-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 20, 2025 at 07:00 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `gapv3`
--

-- --------------------------------------------------------

--
-- Table structure for table `acc_doctor`
--

CREATE TABLE `acc_doctor` (
  `id_table_doctor` int(11) NOT NULL,
  `id_doctor` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `uid_line_doctor` varchar(50) NOT NULL,
  `password_doctor` varchar(256) NOT NULL,
  `fullname_doctor` varchar(50) NOT NULL,
  `station_doctor` varchar(50) NOT NULL,
  `img_doctor` longblob NOT NULL,
  `status_account` tinyint(1) NOT NULL,
  `status_delete` tinyint(1) NOT NULL,
  `time_online` varchar(60) NOT NULL,
  `doctor_role` tinyint(1) NOT NULL,
  `analyst_role` tinyint(1) NOT NULL,
  `consultant_role` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `acc_doctor`
--

INSERT INTO `acc_doctor` (`id_table_doctor`, `id_doctor`, `uid_line_doctor`, `password_doctor`, `fullname_doctor`, `station_doctor`, `img_doctor`, `status_account`, `status_delete`, `time_online`, `doctor_role`, `analyst_role`, `consultant_role`) VALUES
(1, '1000', 'Uf053bedbbccd5bf7469c5f0a2cbe6f97', '03ac674216f3e15c761ee1a5e255f067953623c8b388b4459e13f978d7c846f4', 'บุษบง ศรีสุข', '1', '', 1, 0, '1742570535307', 1, 1, 1),
(2, '1003', 'Uec52e5da629da4c89c55674831d126a8', '1d7f7021ffe549796f76b7fc6f97709c1275e02b0e5e72540d725f9a70c99a5f', 'มานะ ใจดี', '1', '', 1, 1, '1739819719079', 1, 1, 1),
(3, '1001', '', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', '', '', '', 0, 1, '', 1, 1, 1),
(4, '1002', '', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', '', '', '', 1, 0, '', 1, 0, 1),
(5, '1004', '', '1d7f7021ffe549796f76b7fc6f97709c1275e02b0e5e72540d725f9a70c99a5f', 'สุขกาย สบายใจ', '1', '', 1, 0, '', 0, 0, 1),
(14, '1111', '', '0ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c', '', '', '', 1, 0, '', 1, 0, 1),
(15, '1112', '', 'fe91a760983d401d9b679fb092b689488d1f46d92f3af5e9e93363326f3e8aa4', 'สามัคคี มีพลัง', '1', '', 1, 0, '1742468323067', 0, 1, 1),
(16, '1172', '', '02ede7e8caf71df40a5bb6495f5fcbc092cf7c87de6beed5d7813910d82ba3bd', '', '', '', 1, 1, '', 1, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `acc_farmer`
--

CREATE TABLE `acc_farmer` (
  `id_table` int(11) NOT NULL,
  `id_farmer` varchar(50) NOT NULL,
  `id_table_doctor` varchar(50) NOT NULL,
  `fullname` varchar(50) NOT NULL,
  `img` longblob NOT NULL,
  `station` varchar(50) NOT NULL,
  `location` point NOT NULL,
  `password` varchar(256) NOT NULL,
  `register_auth` tinyint(1) NOT NULL,
  `date_register` datetime NOT NULL DEFAULT current_timestamp(),
  `date_doctor_confirm` varchar(100) NOT NULL,
  `uid_line` varchar(255) NOT NULL,
  `link_user` varchar(50) NOT NULL,
  `tel_number` varchar(15) NOT NULL,
  `text_location` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `acc_farmer`
--

INSERT INTO `acc_farmer` (`id_table`, `id_farmer`, `id_table_doctor`, `fullname`, `img`, `station`, `location`, `password`, `register_auth`, `date_register`, `date_doctor_confirm`, `uid_line`, `link_user`, `tel_number`, `text_location`) VALUES
(11, '', '', 'ธนวัฒน์ เอี่ยมละออ', '', '1', '', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 0, '2024-12-07 02:16:04', '', 'U915317b45fea27966b03ff8e47960321', 'U915317b45fea27966b03ff8e47960321', '0902959765', 'Test'),
(12, '11111111111111', '3', 'ธนสิน บุญนาม', '', '1', '', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 1, '2024-12-08 20:11:32', '2025-02-17 16:25:18.883', 'Ua8b22795d7a7836d34964c41eb7e79f8', 'Ua8b22795d7a7836d34964c41eb7e79f8', '0869851715', 'นนท'),
(15, '', '', 'สมัคร พร้อมใช้', '', '1', '', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 0, '2025-02-03 23:18:27', '', 'Ueb1127b25325ef4c44e790ba5f733972', 'Ueb1127b25325ef4c44e790ba5f733972', '0909099999', 'บ้านเลขที่ 55 หมู่ 7'),
(16, '678', '1', 'พชรพล สวัสดี', '', '1', '', '59d1835bf95be08a4d0cb6a35a2f178ea443d68c6eb6a5abfb1e9b0ffa4bc832', 1, '2025-02-06 00:27:47', '2025-02-19 22:53:12.488', 'U7de7081c9429b3810494b67b196b862c', 'U7de7081c9429b3810494b67b196b862c', '0985492779', '123'),
(18, '', '', 'นภัสสร แก้วไพ', '', '1', '', 'f0ed1b4511c60396aab909f7e61f2f47e1551d5afdddb9136e31ecaa9a99823b', 0, '2025-02-19 16:12:52', '', 'Ua92e362c792ca72b2e2fce43a7786997', 'Ua92e362c792ca72b2e2fce43a7786997', '0842942513', '62 หมู่12 ต.บึงชำอ้อ อ.หนองเสือ จ.ปทุม'),
(19, '', '', 'ธีรวัฒน์ บริสุทธิ์', '', '1', '', '355e9e39a49ac6a107d1cfe4fb8ec04ca0244ad9e463043f97582d6b057c1630', 0, '2025-02-19 16:13:38', '', 'U9c9c9a62c127ac538165eaba8baf2c55', 'U9c9c9a62c127ac538165eaba8baf2c55', '0655568486', '110หมู่8 ต.หนองกระทุ่ม อ.กำแพงแสน'),
(20, '', '', 'ธนสิน บุญนาม', '', '1', '', '5600715f42bf51c40dc330d750cd996f58fead4ddea56466ce7498d17801b3a5', 0, '2025-02-19 16:14:19', '', 'Ubc97a05b552c98d1d7a3c095cb57f24d', 'Ubc97a05b552c98d1d7a3c095cb57f24d', '0869851715', '99/63'),
(21, '', '', 'ณัฐวุฒิ มาลากอง', '', '1', '', '185a8431346e2d558f8c07552e88575033db085af07ee9401457a57357097f13', 0, '2025-02-19 16:16:14', '', 'Uf611da5001eb34b1625d09a32c1881b1', 'Uf611da5001eb34b1625d09a32c1881b1', '0631958163', '78 หมู่3'),
(22, '', '', 'หนุ่ม โหนกระสวย', '', '1', '', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 0, '2025-02-19 16:26:09', '', 'Ud29f09fa731cf161a9217be0226af0fd', 'Ud29f09fa731cf161a9217be0226af0fd', '0998876542', '99/99 บ้านบึง'),
(23, '', '', 'พชรพล สวัสดี', '', '1', '', '5dee2dd8073610e8fa7b9ad119bc68381a6a04227d291fc84ed61a8ea1aa5b1c', 0, '2025-02-19 23:02:55', '', 'Uf053bedbbccd5bf7469c5f0a2cbe6f97', 'Uf053bedbbccd5bf7469c5f0a2cbe6f97', '0985492779', 'Pppp'),
(25, '', '', 'กัส กัส', '', '1', '', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 0, '2025-02-20 01:37:32', '', 'U9dc7e4d3e19d44d0e5aaab17438073ba', 'U9dc7e4d3e19d44d0e5aaab17438073ba', '0615781538', 'ยูเพล'),
(26, '', '', 'บุษบง ศรีสุข', '', '1', '', '1d7f7021ffe549796f76b7fc6f97709c1275e02b0e5e72540d725f9a70c99a5f', 0, '2025-03-21 15:05:49', '', 'Ufadde6f0e899997ca28b7b15696ca4eb', 'Ufadde6f0e899997ca28b7b15696ca4eb', '0615781538', 'บ้านเลขที่ 6/1 หมู่1 ต.เชียงใหม่ อ.เชียงใหม่');

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL,
  `username` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `password` varchar(100) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `address` point NOT NULL,
  `station_admin` varchar(50) NOT NULL,
  `img_admin` longblob NOT NULL,
  `fullname_admin` varchar(50) NOT NULL,
  `status_account` tinyint(1) NOT NULL,
  `status_delete` tinyint(1) NOT NULL,
  `time_online` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`id`, `username`, `password`, `phone`, `address`, `station_admin`, `img_admin`, `fullname_admin`, `status_account`, `status_delete`, `time_online`) VALUES
(2, '1164', '1d7f7021ffe549796f76b7fc6f97709c1275e02b0e5e72540d725f9a70c99a5f', '0616707990', '', '1', '', 'บุษบง ศรีสุข', 1, 0, ''),
(3, '1165', '1d7f7021ffe549796f76b7fc6f97709c1275e02b0e5e72540d725f9a70c99a5f', '', '', '', '', '', 1, 0, ''),
(4, '1001', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', '', '', '1', '', 'ยินดี สวัสดี', 1, 0, ''),
(5, '1002', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', '', '', '', '', '', 1, 1, ''),
(6, '1166', '7d86b48acdec123e6c4bdb0031bfa9be7471d5728494270685a2227316ba3e8a', '', '', '1', '', 'ปรัญชา คุณค่า', 1, 0, ''),
(7, '1168', '68ac846d8dc1c75da907a425479be9ddf766b4dc1e172b195cfbb9738ed895dc', '', '', '1', '', 'ไฟฟ้า คำราม', 1, 0, ''),
(8, '1169', '36d144ea081f24500bf72163ccde3d47487366cc47e9ea2fa199f60bbbcee648', '', '', '', '', '', 1, 1, ''),
(9, 'admin', '8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918', '00000000', 0x00000000010100000000000000000000000000000000000000, '', '', '', 1, 0, '');

-- --------------------------------------------------------

--
-- Table structure for table `because_delete`
--

CREATE TABLE `because_delete` (
  `id` int(11) NOT NULL,
  `id_table_doctor` varchar(50) NOT NULL,
  `id_admin` varchar(50) NOT NULL,
  `because_text` longtext NOT NULL,
  `date` varchar(50) NOT NULL,
  `role` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `because_delete`
--

INSERT INTO `because_delete` (`id`, `id_table_doctor`, `id_admin`, `because_text`, `date`, `role`) VALUES
(4, '16', '1164', 'ทดสอบลบบัญชี', '2025-03-21 18:07:39.517', 1),
(5, '8', '1164', 'ทดสอบลบบัญชีผู้ดูแลระบบ', '2025-03-21 18:55:04.641', 0);

-- --------------------------------------------------------

--
-- Table structure for table `because_status`
--

CREATE TABLE `because_status` (
  `id` int(11) NOT NULL,
  `id_table_doctor` varchar(50) NOT NULL,
  `id_admin` varchar(50) NOT NULL,
  `because_text` longtext NOT NULL,
  `date` varchar(50) NOT NULL,
  `type_status` tinyint(1) NOT NULL,
  `role` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `because_status`
--

INSERT INTO `because_status` (`id`, `id_table_doctor`, `id_admin`, `because_text`, `date`, `type_status`, `role`) VALUES
(3, '16', '1164', 'ทดสอบปิดบัญชี', '2025-03-21 17:06:55.827', 0, 1),
(4, '16', '1164', 'ทดสอบเปิดบัญชี', '2025-03-21 17:39:32.783', 1, 1),
(5, '8', '1164', 'ทดสอบปิดบัญชีผู้ดูแลระบบ', '2025-03-21 18:47:58.370', 0, 0),
(6, '8', '1164', 'ทดสอบเปิดบัญชีผู้ดูแลระบบ', '2025-03-21 18:51:20.196', 1, 0);

-- --------------------------------------------------------

--
-- Table structure for table `check_form_detail`
--

CREATE TABLE `check_form_detail` (
  `id` int(11) NOT NULL,
  `id_plant` varchar(50) NOT NULL,
  `status_check` int(11) NOT NULL,
  `note_text` longtext NOT NULL,
  `id_table_doctor` int(11) NOT NULL,
  `date_check` datetime NOT NULL DEFAULT current_timestamp(),
  `acknowledged` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `check_form_detail`
--

INSERT INTO `check_form_detail` (`id`, `id_plant`, `status_check`, `note_text`, `id_table_doctor`, `date_check`, `acknowledged`) VALUES
(5, '1738934534064', 1, '', 3, '2025-02-07 20:54:25', 0),
(6, '1738916192668', 1, '', 3, '2025-02-07 21:36:33', 0),
(7, '1739105767567', 1, '', 3, '2025-02-09 22:35:20', 0),
(8, '1739110309598', 1, '', 3, '2025-02-10 00:52:03', 0),
(9, '1739374265887', 1, '', 3, '2025-02-13 00:48:50', 1),
(10, '1739434059772', 1, '', 3, '2025-02-13 15:30:38', 0),
(11, '1739374103574', 1, '', 3, '2025-02-13 18:24:05', 0),
(12, '1739374504183', 1, '', 3, '2025-02-13 19:04:49', 1),
(13, '1739957811027', 1, '', 1, '2025-02-22 23:33:54', 1),
(14, '1742545366203', 1, '', 1, '2025-03-21 21:54:54', 1);

-- --------------------------------------------------------

--
-- Table structure for table `check_plant_detail`
--

CREATE TABLE `check_plant_detail` (
  `id` int(11) NOT NULL,
  `id_plant` varchar(50) NOT NULL,
  `status_check` int(11) NOT NULL,
  `state_check` tinyint(1) NOT NULL,
  `note_text` longtext NOT NULL,
  `id_table_doctor` int(11) NOT NULL,
  `date_check` datetime NOT NULL DEFAULT current_timestamp(),
  `acknowledged` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `check_plant_detail`
--

INSERT INTO `check_plant_detail` (`id`, `id_plant`, `status_check`, `state_check`, `note_text`, `id_table_doctor`, `date_check`, `acknowledged`) VALUES
(8, '1738934534064', 1, 0, '', 3, '2025-02-07 20:57:20', 0),
(9, '1738934534064', 5, 1, '', 3, '2025-02-07 21:13:27', 0),
(10, '1738916192668', 1, 0, '', 3, '2025-02-07 21:36:51', 0),
(11, '1739105767567', 0, 0, '', 3, '2025-02-09 22:35:30', 0),
(12, '1739105767567', 5, 1, '', 3, '2025-02-09 23:35:12', 0),
(13, '1739374265887', 1, 0, '', 3, '2025-02-13 00:48:58', 1),
(14, '1739374265887', 3, 0, 'ดีปานกลาง', 3, '2025-02-13 03:05:28', 1),
(15, '1739434059772', 1, 0, '', 3, '2025-02-13 15:30:48', 0),
(16, '1739434059772', 5, 1, '', 3, '2025-02-13 15:41:13', 0),
(17, '1739374103574', 0, 0, '', 3, '2025-02-13 18:24:15', 0),
(18, '1739374103574', 3, 0, '', 3, '2025-02-13 18:28:01', 0),
(19, '1739374103574', 4, 0, '', 3, '2025-02-13 18:38:43', 0),
(20, '1739374103574', 5, 1, '', 3, '2025-02-13 18:38:59', 0),
(21, '1739374504183', 0, 0, '', 3, '2025-02-13 19:04:59', 1),
(22, '1739374504183', 2, 0, '', 3, '2025-02-13 19:07:29', 1),
(23, '1739957172333', 5, 0, '', 1, '2025-02-19 17:06:38', 1),
(24, '1739957172333', 5, 0, '', 1, '2025-02-19 17:06:38', 1),
(25, '1739957172333', 5, 0, '', 1, '2025-02-19 17:06:39', 1),
(26, '1739957158454', 2, 0, '', 1, '2025-02-19 17:10:27', 1),
(27, '1739957114825', 2, 0, '', 1, '2025-02-19 17:11:19', 1),
(28, '1739957114825', 1, 1, '', 1, '2025-02-19 17:18:06', 1),
(29, '1739957811027', 0, 0, '', 1, '2025-02-22 23:33:46', 1),
(30, '1742545366203', 1, 0, '', 1, '2025-03-21 22:05:58', 1),
(31, '1742545366203', 5, 1, 'ดีมาก', 1, '2025-03-21 22:06:53', 1);

-- --------------------------------------------------------

--
-- Table structure for table `chemical_list`
--

CREATE TABLE `chemical_list` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `name_formula` varchar(50) NOT NULL,
  `how_use` longtext NOT NULL,
  `date_safe_list` int(11) NOT NULL,
  `is_use` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `chemical_list`
--

INSERT INTO `chemical_list` (`id`, `name`, `name_formula`, `how_use`, `date_safe_list`, `is_use`) VALUES
(1, 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ฉีดพ่น', 11, 1),
(2, 'ไดเทน', 'เเมนโคเซบ', 'ฉีดพ่น', 14, 1),
(6, 'เฮดไลน์', 'ไพรกโครสโตรบิล', 'ฉีดพ่น', 14, 1),
(7, 'เเม็กต้า', 'อะบาเเม็กติน', 'ฉีดพ่น', 24, 1),
(8, 'เเอคทารา', 'ไทอะมีทอกเเซม', 'ฉีดพ่น', 25, 1),
(9, 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ฉีดพ่น', 15, 1),
(11, 'โมแลน', 'อะเซทามิพิท', 'ฉีดพ่น', 10, 1);

-- --------------------------------------------------------

--
-- Table structure for table `detailedit`
--

CREATE TABLE `detailedit` (
  `id_detail` int(11) NOT NULL,
  `id_edit` int(11) NOT NULL,
  `subject_form` varchar(20) NOT NULL,
  `old_content` varchar(100) NOT NULL,
  `new_content` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `detailedit`
--

INSERT INTO `detailedit` (`id_detail`, `id_edit`, `subject_form`, `old_content`, `new_content`) VALUES
(159, 113, 'insect', 'เลือก', 'เพลี้ยไฟ'),
(160, 115, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(161, 116, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(162, 117, 'generation', '1', '2'),
(163, 117, 'history', '', 'ไม่มี'),
(164, 117, 'qtyInsect', '', 'ปานกลาง'),
(165, 118, 'date_glow', '2025-##-##', '2025-11-12'),
(166, 119, 'date_glow', '2025-##-##', '2025-11-12'),
(167, 120, 'date_glow', '2025-##-##', '2025-11-12'),
(168, 121, 'generation', '32', '32'),
(169, 121, 'qty', '20', '10'),
(170, 122, 'date_success', '', '-11-##'),
(171, 123, 'date_success', '', '-11-##'),
(172, 123, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(173, 124, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(174, 125, 'unit', 'ไร่', 'โรงเรือน'),
(175, 125, 'qty', '11', '12'),
(176, 126, 'date_glow', '2025-##-##', '2025-12-13'),
(177, 127, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(178, 128, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(179, 129, 'date_glow', '2025-##-##', '2025-1-3'),
(180, 130, 'date_glow', '2025-##-##', '2025-11-12'),
(181, 131, 'date_glow', '2025-##-##', '2025-11-13'),
(182, 132, 'date_glow', '2025-##-##', '2025-11-11'),
(183, 132, 'unit', 'โรงเรือน', 'ไร่'),
(184, 132, 'remark', '-', 'วันที่คาด'),
(185, 133, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(186, 133, 'remark', '-', 'พื้นที่'),
(187, 134, 'date_harvest', '2025-03-27 07:00:00.000', '2025-3-25'),
(188, 134, 'unit', 'ไร่', 'โรงเรือน'),
(189, 134, 'remark', '-', 'พื้นที่'),
(190, 135, 'unit', 'ตารางเมตร', 'ไร่'),
(191, 136, 'unit', 'ตารางเมตร', 'โรงเรือน'),
(192, 136, 'remark', '-', 'กก'),
(193, 137, 'qty', '200', '20'),
(194, 138, 'unit', 'ตารางเมตร', 'โรงเรือน'),
(195, 139, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(196, 140, 'unit', 'ตารางเมตร', 'ตารางเมตร'),
(197, 141, 'qty', '1', '100'),
(198, 142, 'unit', 'โรงเรือน', 'ตารางเมตร'),
(199, 145, 'generation', '32', '30'),
(200, 146, 'date_harvest', '2025-04-05 07:00:00.000', '2025-11-5'),
(201, 147, 'unit', 'ตารางเมตร', 'ไร่'),
(202, 148, 'date_harvest', '2025-03-27 07:00:00.000', '2025-7-27'),
(203, 149, 'unit', 'ไร่', 'โรงเรือน'),
(204, 150, 'date_glow', '2022-##-##', '2022-2-4'),
(205, 151, 'posi_w', '2', '20'),
(206, 151, 'posi_h', '5', '50'),
(207, 151, 'qty', '10', '500'),
(208, 152, 'date_plant', '2025-02-20 07:00:00.000', '2025-02-21'),
(209, 152, 'date_harvest', '2025-03-02 07:00:00.000', '2025-03-06'),
(210, 153, 'qty', '100', '200'),
(211, 154, 'rate', '10', '20'),
(212, 155, 'source', 'สหกรณ์คลองหลวง', 'สหกรณ์คลองหก');

-- --------------------------------------------------------

--
-- Table structure for table `ecph`
--

CREATE TABLE `ecph` (
  `id` int(11) NOT NULL,
  `id_formplant` varchar(50) NOT NULL,
  `timestamp` datetime NOT NULL DEFAULT current_timestamp(),
  `ec_value` decimal(5,2) NOT NULL,
  `ph_value` decimal(5,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `ecph`
--

INSERT INTO `ecph` (`id`, `id_formplant`, `timestamp`, `ec_value`, `ph_value`) VALUES
(1, '1739196206602', '2025-04-05 10:00:00', 2.55, 6.80),
(2, '1739957114825', '2025-04-05 10:05:00', 2.60, 6.85),
(3, '1739957114825', '2025-04-05 10:10:00', 2.58, 6.82),
(4, '1739434791314', '2025-04-05 10:15:00', 2.62, 6.88),
(5, '1739434791314', '2025-04-05 10:20:00', 2.65, 6.90);

-- --------------------------------------------------------

--
-- Table structure for table `editform`
--

CREATE TABLE `editform` (
  `id_edit` int(11) NOT NULL,
  `id_form` varchar(50) NOT NULL,
  `id_doctor` varchar(50) NOT NULL,
  `id_doctor_edit` int(11) DEFAULT NULL,
  `because` varchar(100) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `note` varchar(100) NOT NULL,
  `status` int(11) NOT NULL,
  `type_form` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `editform`
--

INSERT INTO `editform` (`id_edit`, `id_form`, `id_doctor`, `id_doctor_edit`, `because`, `date`, `note`, `status`, `type_form`) VALUES
(69, '1739362040035', '', NULL, 'เเหล่งน้ำ', '2025-02-12 19:07:48', '', 0, 'plant'),
(70, '1739362040035', '', NULL, 'พื้นที่', '2025-02-12 19:09:16', '', 0, 'plant'),
(71, '1739367431009', '', 1, 'วิธีรดน้ำ', '2025-02-12 20:44:55', '', 0, 'plant'),
(72, '1739369718606', '', 1, 'รูปเเบบการปลูก', '2025-02-12 21:52:07', '', 0, 'plant'),
(73, '1739371982912', '', NULL, 'โรคพืช', '2025-02-12 21:53:18', '', 0, 'plant'),
(74, '1739374504183', '3', 1, 'การรดน้ำ', '2025-02-13 00:26:50', 'ใช้สปริงเกอร์เเบบเดิม', 1, 'plant'),
(75, '1739374504183', '3', NULL, 'ระหว่างต้น', '2025-02-13 00:27:37', 'ความกว้างต้อง20', 2, 'plant'),
(76, '1739434059772', '', NULL, 'just fun', '2025-02-13 15:15:42', '', 0, 'plant'),
(77, '1739374504183', '', NULL, 'เเก้เป็น20', '2025-02-14 19:15:03', '', 0, 'plant'),
(78, '1739374504183', '3', NULL, 'เเก้ไขให้ระยะเเถวเป็น20', '2025-02-14 19:21:11', 'เรียบร้อยดี', 1, 'plant'),
(79, '1739374504183', '3', NULL, 'พื้นที่เปลี่ยนเป็นหน่วยไร่', '2025-02-14 19:33:44', 'เป็นโรงเรือน', 2, 'plant'),
(80, '1739374504183', '3', NULL, 'จำนวนต้น', '2025-02-14 19:36:04', 'เป็น22ต้น', 1, 'plant'),
(81, '1739374504183', '3', NULL, 'จำนวนต้น', '2025-02-14 19:37:22', 'จำนวนต้นเป็น20ต้น', 2, 'plant'),
(82, '1739374504183', '3', NULL, 'จำนวนต้น', '2025-02-14 19:39:02', 'เรียบร้อย', 1, 'plant'),
(83, '145', '3', NULL, 'เปลี่ยนโรคพืช', '2025-02-14 20:03:22', 'ใบจุดถูกเเล้ว', 1, 'chemical'),
(84, '145', '3', NULL, 'เเก้โรคพืช', '2025-02-14 20:05:36', 'โรคพืชใบไหมถูกเเล้ว', 2, 'chemical'),
(85, '1739374504183', '3', NULL, 'เเหล่งน้ำ', '2025-02-14 20:17:26', 'วว', 2, 'plant'),
(86, '1739374504183', '3', NULL, 'พื้นที่', '2025-02-14 20:27:14', 'ท', 2, 'plant'),
(87, '1739374504183', '3', NULL, 'gg', '2025-02-14 20:30:52', 'z', 1, 'plant'),
(88, '145', '3', NULL, 'v', '2025-02-14 20:35:12', '\'', 2, 'chemical'),
(89, '1739374504183', '3', NULL, '\'', '2025-02-14 20:39:38', '\'', 2, 'plant'),
(90, '1739374504183', '3', NULL, 'รุ่น', '2025-02-14 20:59:14', '23ถูกเเล้ว', 2, 'plant'),
(91, '1739374504183', '3', NULL, 'ไร่', '2025-02-14 20:59:29', 'เรียบร้อย', 1, 'plant'),
(92, '1739374504183', '3', NULL, 'รุ่น', '2025-02-14 21:25:50', 'เรียบร้อย', 1, 'plant'),
(93, '1739374504183', '3', NULL, 'รุ่น', '2025-02-14 21:26:21', 'เรียบร้อย', 1, 'plant'),
(94, '1739374504183', '3', NULL, 'รุ่น', '2025-02-14 21:31:46', 'no', 2, 'plant'),
(95, '1739374504183', '3', NULL, 'รุ่น', '2025-02-14 21:31:59', 'ok', 1, 'plant'),
(96, '145', '3', NULL, 'สารเคมี', '2025-02-14 23:21:41', 'ำ', 2, 'chemical'),
(97, '1739374504183', '3', NULL, 'พื้นที่', '2025-02-14 23:32:35', 'no', 2, 'plant'),
(98, '1739374265887', '', NULL, 'ระยะการปลูก', '2025-02-16 16:01:04', '', 0, 'plant'),
(99, '1739771794945', '', NULL, 'โรคพืช', '2025-02-17 12:57:05', '', 0, 'plant'),
(100, '150', '', NULL, 'ศัตรูพืช', '2025-02-17 12:58:15', '', 0, 'chemical'),
(101, '151', '', NULL, 'ศัตรู', '2025-02-17 14:11:19', '', 0, 'chemical'),
(102, '10', '', NULL, 'กก', '2025-02-17 14:11:51', '', 0, 'fertilizer'),
(103, '1739797570772', '', NULL, 'พื้นที่', '2025-02-17 20:06:48', '', 0, 'plant'),
(104, '153', '', NULL, 'x', '2025-02-17 20:07:55', '', 0, 'chemical'),
(105, '1739818651635', '', NULL, 'พื้นที่', '2025-02-18 01:58:06', '', 0, 'plant'),
(106, '155', '', NULL, 'ปริมาณ', '2025-02-18 02:05:57', '', 0, 'chemical'),
(107, '11', '', NULL, 'ปริมาณ', '2025-02-18 02:06:31', '', 0, 'fertilizer'),
(108, '1739149136936', '', 3, '', '2025-02-18 02:26:29', '', 0, 'plant'),
(109, '1739149136936', '', 3, '', '2025-02-18 02:28:00', '', 0, 'plant'),
(110, '1739374504183', '', 3, '', '2025-02-18 02:35:13', '', 0, 'plant'),
(111, '1739204770858', '', 1, '', '2025-02-19 01:49:59', '', 0, 'plant'),
(112, '1739197757792', '', 1, '', '2025-02-19 01:50:36', '', 0, 'plant'),
(113, '1739374504183', '', NULL, 'โรคพืช', '2025-02-19 01:51:22', '', 0, 'plant'),
(114, '1739374504183', '', 1, '', '2025-02-19 02:00:37', '', 0, 'plant'),
(115, '1739196206602', '', 1, '', '2025-02-19 15:24:42', '', 0, 'plant'),
(116, '1739196206602', '', 1, '', '2025-02-19 15:24:43', '', 0, 'plant'),
(117, '1739957172333', '', NULL, 'เนื่องจากใส่รุ่นผิด', '2025-02-19 16:35:26', '', 0, 'plant'),
(118, '1739906988531', '', 1, '', '2025-02-19 19:35:04', '', 0, 'plant'),
(119, '1739906988531', '', 1, '', '2025-02-19 19:35:05', '', 0, 'plant'),
(120, '1739906988531', '', 1, '', '2025-02-19 19:35:08', '', 0, 'plant'),
(121, '1739906988531', '', 1, '', '2025-02-19 19:36:41', '', 0, 'plant'),
(122, '1739906988531', '', 1, '', '2025-02-19 19:38:22', '', 0, 'plant'),
(123, '1739906988531', '', 1, '', '2025-02-19 19:39:02', '', 0, 'plant'),
(124, '1739698466666', '', 1, '', '2025-02-19 19:43:00', '', 0, 'plant'),
(125, '1739193976397', '', 1, '', '2025-02-19 19:45:42', '', 0, 'plant'),
(126, '1739957998859', '', 1, '', '2025-02-19 20:09:25', '', 0, 'plant'),
(127, '1739957998859', '', 1, '', '2025-02-19 20:10:06', '', 0, 'plant'),
(128, '1739957998859', '', 1, '', '2025-02-19 20:10:23', '', 0, 'plant'),
(129, '1739196206602', '', 1, '', '2025-02-19 20:21:04', '', 0, 'plant'),
(130, '1739196206602', '', 1, '', '2025-02-19 20:22:06', '', 0, 'plant'),
(131, '1739196206602', '', 1, '', '2025-02-19 20:24:33', '', 0, 'plant'),
(132, '1739698466666', '', 1, '', '2025-02-19 20:31:43', '', 0, 'plant'),
(133, '1739698466666', '', 1, '', '2025-02-19 20:32:42', '', 0, 'plant'),
(134, '1739196052440', '', 1, '', '2025-02-19 20:35:35', '', 0, 'plant'),
(135, '1739821232743', '', 1, '', '2025-02-19 20:40:09', '', 0, 'plant'),
(136, '1739821232743', '', 1, '', '2025-02-19 20:42:11', '', 0, 'plant'),
(137, '1739958184613', '', 1, '', '2025-02-19 20:48:39', '', 0, 'plant'),
(138, '1739821232743', '', 1, '', '2025-02-19 20:59:13', '', 0, 'plant'),
(139, '1739958184613', '', 1, '', '2025-02-19 21:00:25', '', 0, 'plant'),
(140, '1739958184613', '', 1, '', '2025-02-19 21:00:50', '', 0, 'plant'),
(141, '1739900608320', '', 1, '', '2025-02-19 21:05:24', '', 0, 'plant'),
(142, '1739906988531', '', 1, '', '2025-02-19 21:14:12', '', 0, 'plant'),
(143, '1739906988531', '', 1, '', '2025-02-19 21:39:53', '', 0, 'plant'),
(144, '1739698466666', '', 1, '', '2025-02-19 21:43:02', '', 0, 'plant'),
(145, '1739906988531', '', 1, '', '2025-02-19 21:45:11', '', 0, 'plant'),
(146, '1739906988531', '', 1, '', '2025-02-19 22:40:29', '', 0, 'plant'),
(147, '1739958184613', '', 1, '', '2025-02-19 22:45:37', '', 0, 'plant'),
(148, '1739197757792', '', 1, 'วันที่เก็บเกี่ยว', '2025-02-20 00:13:27', '', 1, 'plant'),
(149, '1739197757792', '', 1, 'พท', '2025-02-20 00:14:19', '', 1, 'plant'),
(150, '1739985587508', '', 1, 'เพิ่มวัน เเละ เดือนที่เพาะกล้า', '2025-02-21 01:43:33', '', 0, 'plant'),
(151, '1739985587508', '', NULL, 'เพิ่มจำนวนต้น ', '2025-02-21 01:45:07', '', 0, 'plant'),
(152, '1739985587508', '', NULL, 'วันที่', '2025-02-21 19:32:09', '', 0, 'plant'),
(153, '1742545366203', '', NULL, 'เเก้ไขจำนวนต้น', '2025-03-21 15:27:27', '', 0, 'plant'),
(154, '169', '', NULL, 'อัตราที่ผสม', '2025-03-21 15:33:31', '', 0, 'chemical'),
(155, '20', '', NULL, 'เเหล่งที่ซื้อ', '2025-03-21 15:35:47', '', 0, 'fertilizer');

-- --------------------------------------------------------

--
-- Table structure for table `fertilizer_list`
--

CREATE TABLE `fertilizer_list` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `name_formula` varchar(50) NOT NULL,
  `how_use` longtext NOT NULL,
  `is_use` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `fertilizer_list`
--

INSERT INTO `fertilizer_list` (`id`, `name`, `name_formula`, `how_use`, `is_use`) VALUES
(1, 'ปุ๋ยตรากระต่าย', 'สูตร 15-15-15', 'หว่านโคนต้น', 1),
(2, 'ปุ๋ยตราเรือไวกิ้ง', 'สูตร 13-13-21', 'หว่านโคนต้น', 1),
(3, 'ขี้ไก่', 'สูตร 0-0-0', 'รองก้นหลุม', 1),
(4, 'ขี้วัว', 'สูตร 0-0-0', 'ผสมน้ำพ่น', 1),
(5, 'ขี้วัว', '14-15-15', 'หว่าน', 1),
(6, 'ปุ๋ยหมัก', '0-0-0', 'หว่านโคนต้น', 1);

-- --------------------------------------------------------

--
-- Table structure for table `formchemical`
--

CREATE TABLE `formchemical` (
  `id` int(11) NOT NULL,
  `id_plant` varchar(50) NOT NULL,
  `name` varchar(50) NOT NULL,
  `formula_name` varchar(50) NOT NULL,
  `insect` varchar(100) NOT NULL,
  `use_is` varchar(100) NOT NULL,
  `rate` varchar(20) NOT NULL,
  `volume` varchar(100) NOT NULL,
  `date_safe` varchar(100) NOT NULL,
  `date` varchar(100) NOT NULL,
  `source` varchar(50) NOT NULL,
  `pest_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `formchemical`
--

INSERT INTO `formchemical` (`id`, `id_plant`, `name`, `formula_name`, `insect`, `use_is`, `rate`, `volume`, `date_safe`, `date`, `source`, `pest_id`) VALUES
(116, '1738603709414', 'พรีวาธอน', 'เเมนโซบ', 'ใบจุด', 'ฉีดพ้น', '1', '10 กรัม', '2025-02-10 07:00:00.000', '2025-02-04 07:00:00.000', 'สหกรณืคลองหก', 0),
(117, '1738603632835', 'พรีวาธอน', 'เเมนโซบ', 'แมลงเต่าทอง', 'ฉีดพ้น', '2', '20 กรัม', '2025-03-02 07:00:00.000', '2025-02-04 07:00:00.000', 'สหกรณืคลองหก', 0),
(118, '1738603286610', 'เเอซิดติก', 'เเอซิก', 'ใบจุด', 'ฉีดพ้น', '1', '20 กรัม', '2025-02-20 07:00:00.000', '2025-02-04 07:00:00.000', 'สหกรณืคลองหก', 0),
(119, '1738603286610', 'พรีวาธอน', 'เเมนโซบ', 'แมลงเต่าทอง', 'ฉีดพ้น', '2', '10 กรัม', '2025-03-02 07:00:00.000', '2025-02-04 07:00:00.000', 'สหกรณืคลองหก', 0),
(120, '1738916192668', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ้น', '1', '11 กรัม', '2025-02-08 07:00:00.000', '2025-02-07 07:00:00.000', 'สหกรณืคลองหก', 0),
(121, '1738934534064', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ราเเป้ง', 'ฉีดพ่น', '500', '80 กรัม', '2025-02-08 07:00:00.000', '2025-02-07 07:00:00.000', 'สหกรณืคลองหก', 0),
(122, '1738934534064', 'ไดเทน', 'เเมนโคเซบ', 'ใบไหม้', 'สูดดม', '600', '30 มิลลิลิตร', '2025-02-08 07:00:00.000', '2025-02-07 07:00:00.000', 'สหกรณืคลองหก', 0),
(123, '1738916192668', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ่น', '111', '10 กรัม', '2025-02-09 07:00:00.000', '2025-02-08 07:00:00.000', 'สหกรณืคลองหก', 0),
(124, '1738916192668', 'ไดเทน', 'เเมนโคเซบ', 'ใบไหม้', 'ฉีดพ่น', '11', '11 กรัม', '2025-02-09 07:00:00.000', '2025-02-08 07:00:00.000', 'สหกรณืคลองหก', 0),
(125, '1739105767567', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ใบจุด', 'ฉีดพ่น', '1', '0 กรัม', '2025-02-10 07:00:00.000', '2025-02-09 07:00:00.000', 'สหกรณืคลองหก', 0),
(126, '1739105767567', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ่น', '33', '3 กรัม', '2025-02-10 07:00:00.000', '2025-02-09 07:00:00.000', 'สหกรณืคลองหก', 0),
(127, '1739145724923', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'เพลี้ยไฟ', 'ฉีดพ่น', '11', '1 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(128, '1739145762888', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ใบไหม้', 'ฉีดพ่น', '11', '1 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(129, '1738934585074', 'ไดเทน', 'เเมนโคเซบ', 'ใบจุด', 'ฉีดพ่น', '3', '3 มิลลิลิตร', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(130, '1739189648597', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ใบจุด', 'ฉีดพ่น', '22', '2 มิลลิลิตร', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(131, '1739193976397', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ่น', '11', '111 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(132, '1739193976397', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'หนอนกระทู้ผัก', 'ฉีดพ่น', '4', '44 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(133, '1739193976397', 'เฮดไลน์', 'ไทอะมีทอกเเซม', 'ใบไหม้', 'ฉีดพ่น', '3', '33 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(134, '1739197757792', 'ไดเทน', 'เเมนโคเซบ', 'หนอนชอนใบ', 'ฉีดพ่น', '4', '4 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(135, '1739197757792', 'เเอคทารา', 'ไทอะมีทอกเเซม', 'เพลี้ยไฟ', 'ฉีดพ่น', '4', '4 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(136, '1739197757792', 'ไดเทน', 'เเมนโคเซบ', 'เพลี้ยไฟ', 'ฉีดพ่น', '11', '1 กรัม', '2025-02-11 07:00:00.000', '2025-02-10 07:00:00.000', 'สหกรณืคลองหก', 0),
(137, '1739362040035', 'ไดเทน', 'เเมนโคเซบ', 'ราเเป้ง', 'ฉีดพ่น', '1', '1 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(138, '1739362040035', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ่น', '1', '1 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(139, '1739368675906', 'ไดเทน', 'เเมนโคเซบ', 'ใบจุด', 'ฉีดพ่น', '11', '1 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(140, '1739369718606', 'ไดเทน', 'เเมนโคเซบ', 'ใบจุด', 'ฉีดพ่น', '1', '1 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(141, '1739369718606', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'เพลี้ยไฟ', 'ฉีดพ่น', '1', '1 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(142, '1739371982912', 'ไดเทน', 'เเมนโคเซบ', 'ใบไหม้', 'ฉีดพ่น', '3', '3 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(143, '1739371982912', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'เพลี้ยไฟ', 'ฉีดพ่น', '3', '3 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(144, '1739374103574', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ใบจุด', 'ฉีดพ่น', '1', '1 กรัม', '2025-02-13 07:00:00.000', '2025-02-12 07:00:00.000', 'สหกรณืคลองหก', 0),
(145, '1739374504183', 'เเอคทารา', 'ไทอะมีทอกเเซม', 'ใบจุด', 'ฉีดพ่น', '2', '2 กรัม', '2025-02-14 07:00:00.000', '2025-02-13 07:00:00.000', 'สหกรณ์คลองหก', 0),
(146, '1739374504183', 'เเม็กต้า', 'อะบาเเม็กติน', 'ใบไหม้', 'ฉีดพ่น', '2', '2 กรัม', '2025-02-14 07:00:00.000', '2025-02-13 07:00:00.000', 'สหกรณ์คลองหก', 0),
(147, '1739434059772', 'ไดเทน', 'เเมนโคเซบ', 'หนอนใยผัก', 'ฉีดพ่น', '40', '500 มิลลิลิตร', '2025-02-18 07:00:00.000', '2025-02-13 07:00:00.000', 'สหกรณ์คลองหก', 0),
(148, '1739698466666', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ใบไหม้', 'ฉีดพ่น', '2', '2 กรัม', '2025-02-17 07:00:00.000', '2025-02-16 07:00:00.000', 'สหกรณ์คลองหก', 0),
(149, '1739698466666', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ใบจุด', 'ฉีดพ่น', '2', '2 กรัม', '2025-02-18 07:00:00.000', '2025-02-17 07:00:00.000', 'สหกรณ์คลองหก', 0),
(150, '1739771794945', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'หนอนชอนใบ', 'ฉีดพ่น', '1', '1 มิลลิลิตร', '2025-02-18 07:00:00.000', '2025-02-17 07:00:00.000', 'สหกรณ์คลองหก', 0),
(151, '1739776216034', 'คาร์ดาซิม', 'คาร์เบนดาซิม', 'ราเเป้ง', 'ฉีดพ่น', '1', '1 กรัม', '2025-02-18 07:00:00.000', '2025-02-17 07:00:00.000', 'สหกรณ์คลองหก', 0),
(152, '1739776216034', 'ไดเทน', 'เเมนโคเซบ', 'ใบจุด', 'ฉีดพ่น', '2', '2 กรัม', '2025-02-18 07:00:00.000', '2025-02-17 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(153, '1739797570772', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'เพลี้ยไฟ', 'ฉีดพ่น', '1', '1 มิลลิลิตร', '2025-02-23 07:00:00.000', '2025-02-17 07:00:00.000', 'สหกรณ์คลองหก', 0),
(154, '1739818651635', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ่น', '5', '2 กรัม', '2025-02-25 07:00:00.000', '2025-02-18 07:00:00.000', 'สหกรณ์คลองหก', 0),
(155, '1739818651635', 'เเม็กต้า', 'อะบาเเม็กติน', 'ใบจุด', 'ฉีดพ่น', '1', '2 มิลลิลิตร', '2025-02-20 07:00:00.000', '2025-02-18 07:00:00.000', 'สหกรณ์คลองหก', 0),
(156, '1739821166754', 'ไดเทน', 'เเมนโคเซบ', 'เพลี้ยอ่อน', 'ฉีดพ่น', '3', '2 กรัม', '2025-02-22 07:00:00.000', '2025-02-18 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(157, '1739818651635', 'เเม็กต้า', 'อะบาเเม็กติน', 'ใบจุด', 'ฉีดพ่น', '2', '3 กรัม', '2025-02-20 07:00:00.000', '2025-02-18 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(158, '1739821232743', 'ไดเทน', 'เเมนโคเซบ', 'เพลี้ยไฟ', 'ฉีดพ่น', '2', '3 กรัม', '2025-02-22 07:00:00.000', '2025-02-18 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(159, '1739957172333', 'โมแลน', 'อะเซทามิพิท', 'เพลี้ยอ่อน', 'ฉีดพ่น', '20', '100 กรัม', '2025-02-19 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหก', 0),
(160, '1739957114825', 'โมแลน', 'อะเซทามิพิท', 'ใบไหม้', 'ฉีดพ่น', '10', '30 กรัม', '2025-02-19 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(161, '1739957158454', 'ไดเทน', 'เเมนโคเซบ', 'เพลี้ยอ่อน', 'ฉีดพ่น', '25', '500 มิลลิลิตร', '2025-02-19 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(162, '1739957231857', 'เเม็กต้า', 'อะบาเเม็กติน', 'ใบไหม้', 'ฉีดพ่น', '1', '2 กรัม', '2025-02-23 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหก', 0),
(163, '1739957158454', 'เเม็กต้า', 'อะบาเเม็กติน', 'เพลี้ยเเป้ง', 'ฉีดพ่น', '30', '300 กรัม', '2025-02-26 07:00:00.000', '2025-02-19 07:00:00.000', '', 0),
(164, '1739957231857', 'เเอคทารา', 'ไทอะมีทอกเเซม', 'ใบไหม้', 'ฉีดพ่น', '2', '1 กรัม', '2025-02-24 07:00:00.000', '2025-02-19 07:00:00.000', '', 0),
(165, '1739957231857', 'เเม็กต้า', 'อะบาเเม็กติน', 'เพลี้ยไฟ', 'ฉีดพ่น', '1', '2 มิลลิลิตร', '2025-02-23 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหก', 0),
(166, '1739957998859', 'โมแลน', 'อะเซทามิพิท', 'เพลี้ยไฟ', 'ฉีดพ่น', '30', '300 กรัม', '2025-03-02 07:00:00.000', '2025-02-19 07:00:00.000', '', 0),
(167, '1739958184613', 'เเอคทารา', 'ไทอะมีทอกเเซม', 'ใบไหม้', 'ฉีดพ่น', '10', '10 กรัม', '2025-02-19 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหก', 0),
(168, '1739957811027', 'พรีวาธอน', 'คลอนเรนนิลิโพรล', 'ใบจุด', 'ฉีดพ่น', '2', '3 กรัม', '2025-02-18 07:00:00.000', '2025-02-19 07:00:00.000', 'สหกรณ์คลองหลวง', 0),
(169, '1742545366203', 'ไดเทน', 'เเมนโคเซบ', 'เพลี้ยไฟ', 'ฉีดพ่น', '20', '10 กรัม', '2025-04-05 07:00:00.000', '2025-03-21 07:00:00.000', 'สหกรณ์คลองหลวง', 0);

-- --------------------------------------------------------

--
-- Table structure for table `formfertilizer`
--

CREATE TABLE `formfertilizer` (
  `id` int(11) NOT NULL,
  `id_plant` varchar(50) NOT NULL,
  `name` varchar(50) NOT NULL,
  `formula_name` varchar(50) NOT NULL,
  `use_is` varchar(100) NOT NULL,
  `volume` varchar(100) NOT NULL,
  `source` varchar(100) NOT NULL,
  `date` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `formfertilizer`
--

INSERT INTO `formfertilizer` (`id`, `id_plant`, `name`, `formula_name`, `use_is`, `volume`, `source`, `date`) VALUES
(6, '1738934534064', 'กระรอก', '1300', 'กิน', '5 ลิตร', 'สหกรณืคลองหก', '2025-02-07 07:00:00.000'),
(7, '1738934534064', 'กระเป๋า', '161616', 'ทา', '10 ก.ก', 'สหกรณืคลองหก', '2025-02-07 07:00:00.000'),
(8, '1739434059772', 'ปุ๋ยตราเรือไวกิ้ง', 'สูตร 13-13-21', 'หว่านโคลนต้น', '10 ลิตร', 'สหกรณ์คลองหก', '2025-07-07 07:00:00.000'),
(9, '1739374504183', 'ปุ๋ยตรากระต่าย', 'สูตร 15-15-15', 'หว่านโคลนต้น', '1 ลิตร', 'สหกรณ์คลองหก', '2025-02-14 07:00:00.000'),
(10, '1739776216034', 'ปุ๋ยตรากระต่าย', 'สูตร 15-15-15', 'หว่านโคนต้น', '1 กก.', 'สหกรณ์คลองหก', '2025-02-17 07:00:00.000'),
(11, '1739818651635', 'ปุ๋ยตราเรือไวกิ้ง', 'สูตร 13-13-21', 'หว่านโคนต้น', '2 กก.', 'สหกรณ์คลองหลวง', '2025-02-18 07:00:00.000'),
(12, '1739957114825', 'ขี้วัว', '14-15-15', 'หว่าน', '50 ลิตร', 'สหกรณ์คลองหก', '2025-02-19 07:00:00.000'),
(13, '1739957172333', 'ปุ๋ยหมัก', '15-15-15', 'หว่านโคนต้น', '10 ลิตร', 'สหกรณ์คลองหก', '2025-02-19 07:00:00.000'),
(14, '1739957158454', 'ขี้ไก่', 'สูตร 0-0-0', 'รองก้นหลุม', '100 กก.', 'สหกรณ์คลองหลวง', '2025-01-26 07:00:00.000'),
(15, '1739957231857', 'ขี้ไก่', 'สูตร 0-0-0', 'รองก้นหลุม', '2 ลิตร', 'สหกรณ์คลองหก', '2025-02-19 07:00:00.000'),
(16, '1739957114825', 'ปุ๋ยตรากระต่าย', 'สูตร 15-15-15', 'หว่านโคนต้น', '50 กก.', 'สหกรณ์คลองหลวง', '2025-02-19 07:00:00.000'),
(17, '1739957231857', 'ปุ๋ยตราเรือไวกิ้ง', 'สูตร 13-13-21', 'หว่านโคนต้น', '1 ลิตร', 'สหกรณ์คลองหก', '2025-02-19 07:00:00.000'),
(18, '1739958184613', 'ขี้ไก่', 'สูตร 0-0-0', 'รองก้นหลุม', '50 ลิตร', 'สหกรณ์คลองหก', '2025-02-19 07:00:00.000'),
(19, '1739374265887', 'ขี้ไก่', 'สูตร 0-0-0', 'รองก้นหลุม', '2 ลิตร', 'สหกรณ์คลองหก', '2025-02-20 07:00:00.000'),
(20, '1742545366203', 'ปุ๋ยตรากระต่าย', 'สูตร 15-15-15', 'หว่านโคนต้น', '10 กก.', 'สหกรณ์คลองหก', '2025-03-21 07:00:00.000');

-- --------------------------------------------------------

--
-- Table structure for table `formplant`
--

CREATE TABLE `formplant` (
  `id` varchar(50) NOT NULL,
  `id_farm_house` varchar(255) NOT NULL,
  `name_plant` varchar(50) NOT NULL,
  `generation` int(11) NOT NULL,
  `date_glow` varchar(50) NOT NULL,
  `date_plant` varchar(50) NOT NULL,
  `posi_w` float NOT NULL,
  `posi_h` float NOT NULL,
  `qty` int(11) NOT NULL,
  `area` float NOT NULL,
  `date_harvest` varchar(50) NOT NULL,
  `system_glow` varchar(50) NOT NULL,
  `water` varchar(50) NOT NULL,
  `water_flow` varchar(50) NOT NULL,
  `history` varchar(50) NOT NULL,
  `insect` varchar(50) NOT NULL,
  `qtyInsect` varchar(50) NOT NULL,
  `seft` varchar(200) NOT NULL,
  `state_status` int(11) NOT NULL,
  `date_success` varchar(50) NOT NULL,
  `unit` varchar(30) NOT NULL,
  `name_varieties` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `formplant`
--

INSERT INTO `formplant` (`id`, `id_farm_house`, `name_plant`, `generation`, `date_glow`, `date_plant`, `posi_w`, `posi_h`, `qty`, `area`, `date_harvest`, `system_glow`, `water`, `water_flow`, `history`, `insect`, `qtyInsect`, `seft`, `state_status`, `date_success`, `unit`, `name_varieties`) VALUES
('1739105767567', '26', 'เรดคอส', 22, '2025-01-01 00:00:00.000', '2025-02-09 07:00:00.000', 44, 4, 4, 4, '2025-03-23 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', '', '', '', '', 2, '2025-02-09 23:35:13.105', 'โรงเรือน', ''),
('1739149136936', '28', 'เรดคอส', 3, '2025-##-##', '2025-02-10 07:00:00.000', 1, 1, 1, 5, '2025-03-24 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'เพลี้ยไฟ', '', '', 0, '', 'โรงเรือน', ''),
('1739189648597', '27', 'เรดคอส', 1, '2025-##-1', '2025-02-10 07:00:00.000', 11, 1, 11, 1, '2025-03-22 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', '', 'ใบจุด', '', '', 0, '', 'ไร่', ''),
('1739193976397', '27', 'เรดคอส', 2, '2025-##-##', '2025-02-10 07:00:00.000', 11, 1, 11, 1, '2025-03-27 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'ใบจุด', '', '', 0, '', 'ไร่', ''),
('1739196052440', '27', 'เรดคอส', 2, '2025-##-9', '2025-02-10 07:00:00.000', 11, 1, 11, 1, '2025-03-27 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'ใบจุด', '', '', 0, '', 'ไร่', ''),
('1739196206602', '27', 'เรดคอส', 2, '2025-##-##', '2025-02-10 07:00:00.000', 11, 1, 11, 1, '2025-03-27 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'ใบจุด', '', '', 0, '', 'โรงเรือน', ''),
('1739197757792', '27', 'เรดคอส', 3, '2025-##-##', '2025-02-10 07:00:00.000', 11, 1, 11, 1, '2025-7-27', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'หนอนกระทู้ผัก', '', '', 0, '', 'โรงเรือน', ''),
('1739204770858', '27', 'เรดคอส', 4, '2025-##-##', '2025-02-10 07:00:00.000', 11, 1, 11, 1, '2025-03-27 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'เพลี้ยไฟ', '', '', 0, '', 'โรงเรือน', ''),
('1739374103574', '34', 'เรดคอส', 21, '2025-##-##', '2025-02-12 07:00:00.000', 2, 2, 21, 1, '2025-03-29 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', '', 'เลือก', '', '', 2, '2025-02-13 18:38:59.321', 'โรงเรือน', ''),
('1739374265887', '34', 'เรดคอส', 22, '2025-##-##', '2025-02-12 07:00:00.000', 22, 20, 21, 1, '2025-03-29 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เลดคอร์ล', 'ใบจุด', 'น้อย', '', 1, '', 'ไร่', ''),
('1739374504183', '34', 'เรดคอส', 26, '2025-##-##', '2025-02-12 07:00:00.000', 22, 20, 20, 1, '2025-03-29 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เลดคอร์ล', 'เพลี้ยไฟ', 'น้อย', '', 1, '', 'โรงเรือน', ''),
('1739434059772', '35', 'เรดคอส', 1, '1979-##-##', '1926-02-08', 7, 5, 100, 1, '1926-03-20', 'ปลูกในวัสดุปลูก', 'บ่อ/สระขุด', 'ระบบน้ำหยด', 'เรด', 'เลือก', 'ปานกลาง', '', 2, '2025-02-13 15:41:13.780', 'โรงเรือน', ''),
('1739434791314', '35', 'เรดคอส', 2, '1983-##-##', '2122-02-08 07:00:00.000', 7, 5, 100, 1, '2122-03-25 07:00:00.000', 'ปลูกในวัสดุปลูก', 'บ่อ/สระขุด', 'ระบบน้ำหยด', 'เรดคอส', 'เลือก', 'ปานกลาง', '', 0, '', '', ''),
('1739698466666', '34', 'เรดคอส', 27, '2025-##-##', '2025-02-16 07:00:00.000', 22, 20, 20, 1, '2025-04-02 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เรดคอส', 'ใบจุด', 'น้อย', '', 0, '', 'โรงเรือน', ''),
('1739771794945', '34', 'เรดคอส', 28, '2025-##-##', '2025-02-17 07:00:00.000', 22, 20, 20, 1, '2025-04-03 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เรดคอส', 'ใบไหม้', 'น้อย', '', 0, '', 'โรงเรือน', ''),
('1739776216034', '34', 'เรดคอส', 29, '2025-##-##', '2025-02-17 07:00:00.000', 22, 20, 20, 1, '2025-04-03 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เรดคอส', 'หนอนชอนใบ', 'ปานกลาง', '', 0, '', 'โรงเรือน', ''),
('1739797570772', '34', 'เรดคอส', 30, '2022-##-##', '2025-02-17 07:00:00.000', 22, 20, 20, 1, '2025-04-03 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เรดคอส', 'ใบจุด', 'ปานกลาง', '', 0, '', 'ไร่', ''),
('1739818651635', '37', 'เรดคอส', 1, '2025-##-##', '2025-02-18 07:00:00.000', 1, 1, 1, 1, '2025-04-04 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', '', 'เลือก', '', '', 0, '', 'ไร่', ''),
('1739821166754', '37', 'เรดคอส', 2, '2021-##-##', '2025-02-18 07:00:00.000', 1, 1, 1, 1, '2025-04-04 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เรดคอส', 'ใบจุด', '', '', 0, '', 'ไร่', ''),
('1739821232743', '37', 'เรดคอส', 3, '2021-##-##', '2025-02-18 07:00:00.000', 1, 1, 1, 1, '2025-04-04 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เรดคอส', 'เพลี้ยอ่อน', '', '', 0, '', 'โรงเรือน', ''),
('1739900608320', '37', 'เรดคอส', 4, '2020-##-##', '2025-02-19 07:00:00.000', 1, 1, 1, 1, '2025-04-05 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'สปริงเกอร์', 'เรดคอส', 'เพลี้ยไฟ', 'ปานกลาง', '', 0, '', 'ไร่', ''),
('1739905650082', '34', 'เรดคอส', 31, '2025-##-##', '2025-02-19 07:00:00.000', 22, 20, 20, 1, '2025-04-05 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เรดคอส', 'เพลี้ยไฟ', 'ปานกลาง', '', 0, '', 'ไร่', ''),
('1739906988531', '34', 'เรดคอส', 32, '2025-##-##', '2025-02-19 07:00:00.000', 22, 20, 20, 1, '2025-04-05 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'อาศัยน้ำฝน', 'ระบบน้ำหยด', 'เรดคอส', 'เลือก', 'ปานกลาง', '', 0, '', 'โรงเรือน', ''),
('1739957114825', '40', 'มะเขือเทศ', 1, '2022-##-##', '2025-02-19 07:00:00.000', 2, 3, 10, 1, '2025-05-20 07:00:00.000', 'ในโรงเรือน', 'บ่อบาดาล', 'ระบบน้ำหยด', '1', 'เลือก', 'ปานกลาง', 'ยา', 2, '2025-02-19 17:18:06.845', 'โรงเรือน', ''),
('1739957158454', '39', 'กะหล่ำปลี', 2, '2025-##-##', '2025-02-19 07:00:00.000', 100, 100, 500, 1, '2025-05-20 07:00:00.000', 'ปลูกในวัสดุปลูก', 'บ่อ/สระขุด', 'ระบบน้ำหยด', '', 'เลือก', '', '', 1, '', 'โรงเรือน', ''),
('1739957172333', '41', 'กะหล่ำปลี', 2, '2023-11-19 07:00:00.000', '2025-02-19 07:00:00.000', 10, 15, 500, 1, '2025-05-20 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'บ่อ/สระขุด', 'สปริงเกอร์', 'ไม่มี', 'เลือก', 'ปานกลาง', '', 1, '', 'ไร่', ''),
('1739957231857', '42', 'กะหล่ำปลี', 1, '2024-12-15 07:00:00.000', '2025-02-19 07:00:00.000', 20, 30, 200, 2, '2025-05-20 07:00:00.000', 'ขึ้นแปลงปลูกที่ลุ่มหลังนา', 'บ่อบาดาล', 'สปริงเกอร์', 'มะเขือเทศ', 'เลือก', 'ปานกลาง', '', 0, '', 'ไร่', ''),
('1739957811027', '38', 'กะหล่ำปม', 2, '2025-##-##', '2025-02-19 07:00:00.000', 25, 25, 50, 1, '2025-04-20 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'ลำธาร/คลองธรรมชาติ', 'ปล่อยตามร่อง', '', 'เลือก', '', '', 1, '', 'ไร่', ''),
('1739957998859', '39', 'กะหล่ำปม', 1, '2025-##-##', '2025-02-19 07:00:00.000', 20, 20, 100, 1, '2025-04-20 07:00:00.000', 'ปลูกแบบขึ้นค้าง', 'บ่อ/สระขุด', 'ใช้สายยางรด', '', 'เลือก', '', '', 0, '', 'โรงเรือน', ''),
('1739958184613', '46', 'เมล่อน', 3, '2023-10-18 07:00:00.000', '2025-02-19 07:00:00.000', 60, 100, 200, 2, '2025-04-20 07:00:00.000', 'ในโรงเรือน', 'อ่างเก็บน้ำ', 'ปล่อยตามร่อง', '', 'เลือก', '', '', 0, '', 'ตารางเมตร', ''),
('1739981233111', '47', 'กะหล่ำปลี', 1, '2025-01-31 00:00:00.000', '2025-02-19 07:00:00.000', 1, 1, 9999, 1, '2025-05-20 07:00:00.000', 'ในโรงเรือน', 'บ่อบาดาล', 'ใช้สายยางรด', '', 'เลือก', '', '', 0, '', 'โรงเรือน', ''),
('1739981670658', '38', 'ฟ้าทะลายโจร', 4, '2021-##-##', '2025-02-19 07:00:00.000', 6, 6, 60, 60, '2025-03-01 07:00:00.000', 'ระบบ Hydroponic', 'บ่อบาดาล', 'ปล่อยตามร่อง', '', 'เลือก', '', '', 0, '', 'ไร่', ''),
('1739981750997', '38', 'กะหล่ำปม', 3, '2023-##-##', '2025-02-19 07:00:00.000', 25, 25, 50, 1, '2025-04-20 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'ลำธาร/คลองธรรมชาติ', 'ปล่อยตามร่อง', 'กะหล่ำปม', 'ใบจุด', '', '', 0, '', 'ไร่', ''),
('1739985492499', '48', 'กะหล่ำปลี', 5, '2022-##-##', '2025-02-20 07:00:00.000', 33, 8, 555, 1, '2025-05-21 07:00:00.000', 'ปลูกแบบขึ้นค้าง', 'บ่อบาดาล', 'ปล่อยตามร่อง', '', 'เลือก', '', '', 0, '', 'โรงเรือน', ''),
('1739985533428', '48', 'กะหล่ำปม', 1, '2021-##-##', '2025-02-20 07:00:00.000', 35, 53, 50, 1, '2025-04-21 07:00:00.000', 'ปลูกแบบขึ้นค้าง', 'บ่อ/สระขุด', 'ปล่อยตามร่อง', '', 'เลือก', '', '', 0, '', 'โรงเรือน', ''),
('1739985569757', '48', 'ฟ้าทะลายโจร', 2, '2021-##-##', '2025-02-20 07:00:00.000', 2, 5, 10, 100, '2025-03-02 07:00:00.000', 'ระบบ Hydroponic', 'อาศัยน้ำฝน', 'ใช้สายยางรด', '', 'เลือก', '', '', 0, '', 'ตารางเมตร', ''),
('1739985587508', '48', 'ฟ้าทะลายโจร', 3, '2022-2-4', '2025-02-21', 20, 50, 500, 100, '2025-03-06', 'ระบบ Hydroponic', 'อาศัยน้ำฝน', 'ใช้สายยางรด', 'ฟ้าทะลายโจร', 'เลือก', '', '', 0, '', 'ไร่', ''),
('1739988144370', '49', 'กระเทียม', 2, '2021-##-##', '2025-02-20 07:00:00.000', 30, 45, 50, 1, '2025-05-21 07:00:00.000', 'ขึ้นแปลงปลูกตามไหล่เขา', 'บ่อบาดาล', 'ปล่อยตามร่อง', '', 'เลือก', '', '', 0, '', 'โรงเรือน', ''),
('1742545366203', '51', 'กะหล่ำปม', 1, '2025-01-01 00:00:00.000', '2025-03-21 07:00:00.000', 20, 20, 200, 1, '2025-05-20 07:00:00.000', 'ระบบ Hydroponic', 'ลำธาร/คลองธรรมชาติ', 'สปริงเกอร์', '', 'เลือก', '', '', 2, '2025-03-21 22:06:53.882', 'โรงเรือน', '');

-- --------------------------------------------------------

--
-- Table structure for table `housefarm`
--

CREATE TABLE `housefarm` (
  `id_farm_house` int(11) NOT NULL,
  `uid_line` varchar(255) NOT NULL,
  `link_user` varchar(50) NOT NULL,
  `name_house` varchar(50) NOT NULL,
  `img_house` longblob NOT NULL,
  `location` point DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `housefarm`
--

INSERT INTO `housefarm` (`id_farm_house`, `uid_line`, `link_user`, `name_house`, `img_house`, `location`, `status`) VALUES
(26, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'Banga', '', 0x000000000101000000cb93b5977e172c401aaec4f21d2f5940, 0),
(27, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'Bangood', '', 0x000000000101000000cb93b5977e172c401aaec4f21d2f5940, 1),
(28, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'Banbud', '', 0x00000000010100000017ddd50682172c40cd3e8f511e2f5940, 0),
(29, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'Banbul', '', 0x000000000101000000accabe2b82172c40df7b6e571e2f5940, 1),
(30, 'Ua8b22795d7a7836d34964c41eb7e79f8', 'Ua8b22795d7a7836d34964c41eb7e79f8', 'ริมน้ำตก', '', 0x000000000101000000b89d6cb9e9252c401112b3a819265940, 1),
(31, 'Ua8b22795d7a7836d34964c41eb7e79f8', 'Ua8b22795d7a7836d34964c41eb7e79f8', 'บนภูเขา', '', 0x000000000101000000572d9f9bec252c402e59709a19265940, 1),
(33, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'บ้านบุษ', '', 0x0000000001010000007d7a6ccb80172c40f73306e71d2f5940, 0),
(34, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'บ้านกัส', '', 0x000000000101000000176d44e680172c40565348e81d2f5940, 0),
(35, 'Ua8b22795d7a7836d34964c41eb7e79f8', 'Ua8b22795d7a7836d34964c41eb7e79f8', 'กล้วยหอม', '', 0x000000000101000000f2892b1d62122c400a4b3ca06c2e5940, 1),
(36, 'Uec52e5da629da4c89c55674831d126a8', 'Uec52e5da629da4c89c55674831d126a8', 'bud', '', 0x0000000001010000000bd3f71a82172c40b58993fb1d2f5940, 0),
(37, 'Ufadde6f0e899997ca28b7b15696ca4eb', 'Ufadde6f0e899997ca28b7b15696ca4eb', 'โรงเรือน ค', '', 0x0000000001010000005f61c1fd80172c40a47d62531d2f5940, 0),
(38, 'Ufadde6f0e899997ca28b7b15696ca4eb', 'Ufadde6f0e899997ca28b7b15696ca4eb', 'โรงเรือน ก', '', 0x000000000101000000bdd98b0d82172c40441669e21d2f5940, 0),
(39, 'Ubc97a05b552c98d1d7a3c095cb57f24d', 'Ubc97a05b552c98d1d7a3c095cb57f24d', 'ก', '', 0x000000000101000000e657738060122c40b691fcd26c2e5940, 1),
(40, 'U9c9c9a62c127ac538165eaba8baf2c55', 'U9c9c9a62c127ac538165eaba8baf2c55', 'WaKaChi', '', 0x000000000101000000bf1c10c367122c40c919be446a2e5940, 1),
(41, 'Ua92e362c792ca72b2e2fce43a7786997', 'Ua92e362c792ca72b2e2fce43a7786997', 'วัฒนา', '', 0x0000000001010000006ac6fda25f122c40b147f2a66c2e5940, 1),
(42, 'Uf611da5001eb34b1625d09a32c1881b1', 'Uf611da5001eb34b1625d09a32c1881b1', 'โรงเรือน1', '', 0x000000000101000000bffbe39773122c40a8d2fc746b2e5940, 1),
(43, 'Ubc97a05b552c98d1d7a3c095cb57f24d', 'Ubc97a05b552c98d1d7a3c095cb57f24d', 'ข', '', 0x0000000001010000002ce45b6963122c40f3ddf7b96b2e5940, 1),
(44, 'Ud29f09fa731cf161a9217be0226af0fd', 'Ud29f09fa731cf161a9217be0226af0fd', 'กระส่วย', '', 0x00000000010100000004b1bf3978122c40f8cb2ec76b2e5940, 1),
(45, 'Ud29f09fa731cf161a9217be0226af0fd', 'Ud29f09fa731cf161a9217be0226af0fd', 'กระสวย', '', 0x000000000101000000bbc0bd3978122c40056f2ec76b2e5940, 1),
(46, 'Ua92e362c792ca72b2e2fce43a7786997', 'Ua92e362c792ca72b2e2fce43a7786997', 'วัฒนะ', '', 0x000000000101000000090e791563122c409ed964436d2e5940, 1),
(47, 'Uf053bedbbccd5bf7469c5f0a2cbe6f97', 'Uf053bedbbccd5bf7469c5f0a2cbe6f97', 'ฮ', '', 0x000000000101000000aa4df79562122c4022a7afe76b2e5940, 1),
(48, 'Ufadde6f0e899997ca28b7b15696ca4eb', 'Ufadde6f0e899997ca28b7b15696ca4eb', 'โรงเรือน ข', '', 0x000000000101000000a2b8e34d7e172c40151f9f901d2f5940, 0),
(49, 'Uea56b26b519bfa8bc9b5855a58f22647', 'Uea56b26b519bfa8bc9b5855a58f22647', 'โรงเรือนสีฟ้า', '', 0x0000000001010000005ee5fd3a8d172c40b376f5681f2f5940, 1),
(50, 'U9dc7e4d3e19d44d0e5aaab17438073ba', 'U9dc7e4d3e19d44d0e5aaab17438073ba', 'F', '', 0x0000000001010000000f4f5c5f8d172c4080b7c35c1f2f5940, 1),
(51, 'Ufadde6f0e899997ca28b7b15696ca4eb', 'Ufadde6f0e899997ca28b7b15696ca4eb', 'โรงเรือน 1', '', 0x000000000101000000bcb9ae4e84172c40147bc3d81d2f5940, 1);

-- --------------------------------------------------------

--
-- Table structure for table `log_admin`
--

CREATE TABLE `log_admin` (
  `id` int(11) NOT NULL,
  `admin_id` int(11) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `message_user`
--

CREATE TABLE `message_user` (
  `id` int(11) NOT NULL,
  `message` longtext NOT NULL,
  `uid_line_farmer` varchar(255) DEFAULT NULL,
  `id_read` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`id_read`)),
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `type` varchar(50) NOT NULL,
  `type_message` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `message_user`
--

INSERT INTO `message_user` (`id`, `message`, `uid_line_farmer`, `id_read`, `date`, `type`, `type_message`) VALUES
(1, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-05-26 23:17:51', '', 'text'),
(2, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:18:00', '', 'text'),
(3, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:19:07', '', 'text'),
(4, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:20:14', '', 'text'),
(5, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:28:58', '', 'text'),
(6, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:29:48', '', 'text'),
(7, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:30:04', '', 'text'),
(8, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:31:45', '', 'text'),
(9, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:33:27', '', 'text'),
(10, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:47:37', '', 'text'),
(11, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:47:46', '', 'text'),
(12, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 01:59:22', '', 'text'),
(13, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:00:25', '', 'text'),
(14, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:00:28', '', 'text'),
(15, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:00:33', '', 'text'),
(16, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:23:49', '', 'text'),
(17, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:24:29', '', 'text'),
(18, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:25:08', '', 'text'),
(19, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:26:30', '', 'text'),
(20, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 02:28:44', '', 'text'),
(21, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 12:30:18', '', 'text'),
(22, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 20:19:04', '', 'text'),
(23, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 20:55:12', '', 'text'),
(24, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 20:55:14', '', 'text'),
(25, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 21:28:06', '', 'text'),
(26, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 21:35:18', '', 'text'),
(27, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 22:08:44', '', 'text'),
(28, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 22:08:47', '', 'text'),
(29, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 22:14:02', '', 'text'),
(30, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 23:19:52', '', 'text'),
(31, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 23:23:41', '', 'text'),
(32, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-05 23:29:09', '', 'text'),
(33, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-06 00:04:04', '', 'text'),
(34, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-06 00:08:48', '', 'text'),
(35, '1', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-06 00:25:19', '', 'text'),
(36, '5', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-06 17:00:13', '', 'text'),
(37, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 00:20:36', '', 'text'),
(38, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 00:23:33', '', 'text'),
(39, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 00:36:39', '', 'text'),
(40, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 00:40:10', '', 'text'),
(41, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 00:43:54', '', 'text'),
(42, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 00:49:54', '', 'text'),
(43, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:00:19', '', 'text'),
(44, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:07:54', '', 'text'),
(45, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:16:55', '', 'text'),
(46, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:17:25', '', 'text'),
(47, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:18:04', '', 'text'),
(48, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:18:34', '', 'text'),
(49, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:18:51', '', 'text'),
(50, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:23:38', '', 'text'),
(51, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:24:08', '', 'text'),
(52, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:24:27', '', 'text'),
(53, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:25:08', '', 'text'),
(54, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 01:27:08', '', 'text'),
(55, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 02:12:18', '', 'text'),
(56, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 02:12:46', '', 'text'),
(57, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 02:17:07', '', 'text'),
(58, '                                      https://liff.line.me/2004738631-53dZvpje/1?date=1245', 'U915317b45fea27966b03ff8e47960321', '{}', '2024-12-07 02:19:24', '', 'text'),
(59, '                                      http://liff.line.me/2004738631-53dZvpje/1?date=1245', 'U915317b45fea27966b03ff8e47960321', '{}', '2024-12-07 02:19:47', '', 'text'),
(60, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 02:23:26', '', 'text'),
(61, 'เลือกโรงเรือน', 'U915317b45fea27966b03ff8e47960321', '{}', '2024-12-07 02:24:38', '', 'text'),
(62, 'เลือกโรงเรือน', 'U915317b45fea27966b03ff8e47960321', '{}', '2024-12-07 02:28:30', '', 'text'),
(63, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-07 02:29:07', '', 'text'),
(64, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-08 14:06:14', '', 'text'),
(65, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-08 15:00:05', '', 'text'),
(66, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-08 15:57:36', '', 'text'),
(67, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-08 15:58:01', '', 'text'),
(68, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2024-12-08 20:17:29', '', 'text'),
(69, 'เลือกโรงเรือน', 'Ua8b22795d7a7836d34964c41eb7e79f8', '{\"1\": \"read\"}', '2024-12-08 20:29:22', '', 'text'),
(70, 'เลือกโรงเรือน', 'Ua8b22795d7a7836d34964c41eb7e79f8', '{\"1\": \"read\"}', '2024-12-08 20:29:41', '', 'text'),
(71, 'เลือกโรงเรือน', 'Ua8b22795d7a7836d34964c41eb7e79f8', '{\"1\": \"read\"}', '2024-12-08 20:30:20', '', 'text'),
(72, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-01-16 19:56:12', '', 'text'),
(73, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-01-16 19:58:52', '', 'text'),
(74, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-01-16 19:59:35', '', 'text'),
(75, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-01-16 20:00:54', '', 'text'),
(76, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-01-16 20:01:35', '', 'text'),
(77, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-03 21:58:27', '', 'text'),
(78, 'เลือกโรงเรือน', 'Ue58117f6252711781d1589732635e00a', '{}', '2025-02-03 22:01:25', '', 'text'),
(79, 'เลือกโรงเรือน', 'Ue58117f6252711781d1589732635e00a', '{}', '2025-02-03 22:02:12', '', 'text'),
(80, 'เลือกโรงเรือน', 'Ueb1127b25325ef4c44e790ba5f733972', '{}', '2025-02-03 23:18:33', '', 'text'),
(81, 'เลือกโรงเรือน', 'Ueb1127b25325ef4c44e790ba5f733972', '{}', '2025-02-03 23:23:25', '', 'text'),
(82, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-04 00:16:40', '', 'text'),
(83, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-04 00:17:43', '', 'text'),
(84, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-04 00:18:10', '', 'text'),
(85, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-04 00:39:39', '', 'text'),
(86, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-06 00:20:01', '', 'text'),
(87, 'เลือกโรงเรือน', 'U7de7081c9429b3810494b67b196b862c', '{\"1\": \"read\"}', '2025-02-06 00:27:57', '', 'text'),
(88, 'เลือกโรงเรือน', 'U7de7081c9429b3810494b67b196b862c', '{\"1\": \"read\"}', '2025-02-06 00:28:18', '', 'text'),
(89, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-06 00:33:10', '', 'text'),
(90, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-06 15:30:57', '', 'text'),
(91, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-06 15:31:45', '', 'text'),
(92, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-07 20:03:06', '', 'text'),
(93, 'เลือกโรงเรือน', 'Ua8b22795d7a7836d34964c41eb7e79f8', '{\"1\": \"read\"}', '2025-02-07 20:06:11', '', 'text'),
(94, 'เลือกโรงเรือน', 'Ua8b22795d7a7836d34964c41eb7e79f8', '{\"1\": \"read\"}', '2025-02-07 20:11:08', '', 'text'),
(95, 'เลือกโรงเรือน', 'Ua8b22795d7a7836d34964c41eb7e79f8', '{\"1\": \"read\"}', '2025-02-07 20:11:42', '', 'text'),
(96, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-07 20:16:04', '', 'text'),
(97, 'เลือกโรงเรือน', 'Uec52e5da629da4c89c55674831d126a8', '{}', '2025-02-08 03:46:03', '', 'text'),
(98, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-18 01:56:12', '', 'text'),
(99, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-18 04:17:25', '', 'text'),
(100, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-18 23:13:41', '', 'text'),
(101, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-18 23:55:12', '', 'text'),
(102, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 00:09:58', '', 'text'),
(103, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 00:14:55', '', 'text'),
(104, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 00:17:34', '', 'text'),
(105, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 00:20:11', '', 'text'),
(106, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 00:24:54', '', 'text'),
(107, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 00:28:38', '', 'text'),
(108, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 02:27:37', '', 'text'),
(109, 'เลือกโรงเรือน', 'Uf611da5001eb34b1625d09a32c1881b1', '{}', '2025-02-19 16:18:19', '', 'text'),
(110, 'เลือกโรงเรือน', 'Ubc97a05b552c98d1d7a3c095cb57f24d', '{}', '2025-02-19 16:18:28', '', 'text'),
(111, 'เลือกโรงเรือน', 'Ua92e362c792ca72b2e2fce43a7786997', '{}', '2025-02-19 16:20:22', '', 'text'),
(112, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 16:33:18', '', 'text'),
(113, 'เลือกโรงเรือน', 'Ua92e362c792ca72b2e2fce43a7786997', '{}', '2025-02-19 16:41:18', '', 'text'),
(114, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 17:13:42', '', 'text'),
(115, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 17:16:01', '', 'text'),
(116, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 22:53:52', '', 'text'),
(117, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-19 22:55:03', '', 'text'),
(118, 'เลือกโรงเรือน', 'Uf053bedbbccd5bf7469c5f0a2cbe6f97', '{}', '2025-02-19 23:03:11', '', 'text'),
(119, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-20 00:17:17', '', 'text'),
(120, 'เลือกโรงเรือน', 'Uea56b26b519bfa8bc9b5855a58f22647', '{}', '2025-02-20 01:00:27', '', 'text'),
(121, 'เลือกโรงเรือน', 'Uea56b26b519bfa8bc9b5855a58f22647', '{}', '2025-02-20 01:01:16', '', 'text'),
(122, 'เลือกโรงเรือน', 'Uea56b26b519bfa8bc9b5855a58f22647', '{}', '2025-02-20 01:05:43', '', 'text'),
(123, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-21 01:15:27', '', 'text'),
(124, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-21 01:15:34', '', 'text'),
(125, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-21 01:34:33', '', 'text'),
(126, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-21 01:36:09', '', 'text'),
(127, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-21 01:37:33', '', 'text'),
(128, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-21 01:48:02', '', 'text'),
(129, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-22 00:37:57', '', 'text'),
(130, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-22 00:38:12', '', 'text'),
(131, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-22 23:46:08', '', 'text'),
(132, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-22 23:48:39', '', 'text'),
(134, 'รดน้ำ', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-26 00:32:49', '1', 'text'),
(135, 'รดน้ำ', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{\"1\": \"read\"}', '2025-02-26 00:33:02', '1', 'text'),
(136, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{}', '2025-03-21 15:11:32', '', 'text'),
(137, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{}', '2025-03-21 15:15:39', '', 'text'),
(138, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{}', '2025-03-21 21:53:23', '', 'text'),
(139, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{}', '2025-03-21 21:56:41', '', 'text'),
(140, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{}', '2025-03-21 21:58:59', '', 'text'),
(141, 'เลือกโรงเรือน', 'Ufadde6f0e899997ca28b7b15696ca4eb', '{}', '2025-03-21 22:08:17', '', 'text');

-- --------------------------------------------------------

--
-- Table structure for table `notify_doctor`
--

CREATE TABLE `notify_doctor` (
  `id` int(11) NOT NULL,
  `id_table_farmer` int(11) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `id_read` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`id_read`)),
  `notify` longtext NOT NULL,
  `station` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `notify_doctor`
--

INSERT INTO `notify_doctor` (`id`, `id_table_farmer`, `date`, `id_read`, `notify`, `station`) VALUES
(1, 1, '2024-05-14 01:36:51', '{\"1\": \"read\", \"3\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(2, 2, '2024-05-15 16:47:33', '{\"1\": \"read\", \"3\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(3, 4, '2024-05-15 17:20:06', '{\"1\": \"read\", \"3\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(4, 5, '2024-05-19 21:07:44', '{\"1\": \"read\", \"3\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(5, 6, '2024-05-23 02:15:58', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(6, 7, '2024-05-25 21:09:50', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(7, 7, '2024-05-26 21:28:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(8, 7, '2024-05-26 21:41:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1716733712564', '1'),
(9, 7, '2024-05-26 21:42:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1716733712564', '1'),
(10, 8, '2024-05-26 23:10:19', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(11, 7, '2024-06-08 01:26:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(12, 7, '2024-06-08 01:31:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1717784792189', '1'),
(13, 7, '2024-06-16 07:31:08', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(14, 7, '2024-06-25 01:30:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(15, 7, '2024-06-25 01:41:56', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(16, 7, '2024-06-25 02:32:41', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(17, 7, '2024-06-25 03:04:45', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(18, 7, '2024-06-25 03:31:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(19, 7, '2024-06-25 03:34:49', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(20, 7, '2024-06-25 03:36:24', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(21, 7, '2024-06-25 03:48:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(22, 7, '2024-06-25 05:22:12', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(23, 7, '2024-06-26 04:02:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(24, 7, '2024-06-26 04:16:35', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(25, 7, '2024-06-26 04:25:15', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(26, 7, '2024-06-26 05:31:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(27, 7, '2024-06-26 10:12:42', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(28, 7, '2024-06-26 13:56:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(29, 7, '2024-06-26 14:56:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(30, 7, '2024-06-26 15:12:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(31, 7, '2024-07-02 13:17:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(32, 7, '2024-07-08 08:41:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(33, 7, '2024-07-08 09:06:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(34, 7, '2024-07-08 11:14:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(35, 7, '2024-07-08 12:43:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(36, 7, '2024-11-24 16:25:56', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(37, 7, '2024-11-24 17:57:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(38, 7, '2024-11-25 21:33:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(39, 7, '2024-11-26 00:51:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1732545234371', '1'),
(40, 7, '2024-11-26 23:22:56', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732440356943', '1'),
(41, 7, '2024-11-26 23:37:49', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732440356943', '1'),
(42, 7, '2024-11-26 23:43:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732440356943', '1'),
(43, 7, '2024-11-29 16:06:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732545234371', '1'),
(44, 7, '2024-12-01 20:29:43', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732545234371', '1'),
(45, 7, '2024-12-01 20:30:22', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732545234371', '1'),
(46, 7, '2024-12-01 20:40:53', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732545234371', '1'),
(47, 7, '2024-12-01 20:41:27', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732545234371', '1'),
(48, 7, '2024-12-01 20:42:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1732545234371', '1'),
(49, 7, '2024-12-04 19:03:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(50, 7, '2024-12-04 19:44:27', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1732545234371', '1'),
(51, 9, '2024-12-05 22:13:56', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(52, 10, '2024-12-05 23:57:20', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(53, 10, '2024-12-06 00:08:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร กัส จัง มีการเพิ่มแบบบันทึก', '1'),
(54, 9, '2024-12-06 00:23:28', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(55, 9, '2024-12-06 23:08:09', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(56, 11, '2024-12-07 02:16:04', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(57, 9, '2024-12-07 02:29:53', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(58, 12, '2024-12-08 20:11:32', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(59, 13, '2024-12-08 22:44:24', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(60, 14, '2024-12-08 23:44:22', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(61, 14, '2024-12-08 23:46:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(62, 14, '2024-12-09 00:21:42', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(63, 14, '2024-12-11 15:22:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(64, 14, '2024-12-11 15:22:33', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(65, 14, '2024-12-12 00:07:33', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(66, 14, '2024-12-12 01:31:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(67, 14, '2024-12-12 02:17:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(68, 14, '2024-12-12 02:17:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(69, 14, '2024-12-12 02:17:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(70, 14, '2024-12-12 02:24:33', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(71, 14, '2024-12-12 02:28:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(72, 14, '2024-12-12 02:31:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(73, 14, '2024-12-12 02:31:45', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(74, 14, '2024-12-12 02:48:35', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(75, 14, '2024-12-12 02:49:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(76, 14, '2024-12-12 02:51:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(77, 14, '2024-12-12 20:57:37', '{\"3\": \"read\", \"1\": \"read\"}', 'แจ้งเตือน: สารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(78, 14, '2024-12-12 21:10:20', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733678502150\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(79, 14, '2024-12-12 21:11:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733678502150\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(80, 14, '2024-12-12 21:12:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733678502150\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(81, 14, '2024-12-12 21:16:49', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733678502150\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(82, 14, '2024-12-12 21:24:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150\n\nแจ้งเตือน: สารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(83, 14, '2024-12-12 21:24:59', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150\n\nแจ้งเตือน: สารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(84, 14, '2024-12-12 21:34:40', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150\n\nแจ้งเตือน: สารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(85, 14, '2024-12-12 21:34:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150\n\nแจ้งเตือน: สารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(86, 14, '2024-12-12 21:37:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150\n\nแจ้งเตือน: สารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(87, 14, '2024-12-12 21:48:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(88, 14, '2024-12-12 22:10:53', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(89, 14, '2024-12-12 22:24:59', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(90, 14, '2024-12-12 22:25:53', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(91, 14, '2024-12-12 22:31:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(92, 14, '2024-12-12 22:32:12', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(93, 14, '2024-12-12 22:46:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(94, 14, '2024-12-12 22:55:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(95, 14, '2024-12-12 23:04:00', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(96, 14, '2024-12-12 23:04:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(97, 14, '2024-12-13 00:38:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(98, 14, '2024-12-13 00:51:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734019440735', '1'),
(99, 14, '2024-12-14 00:13:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(100, 14, '2024-12-14 00:14:20', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(101, 14, '2024-12-14 00:17:08', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(102, 14, '2024-12-14 00:17:57', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(103, 14, '2024-12-14 00:20:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(104, 14, '2024-12-14 00:21:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(105, 14, '2024-12-14 00:21:23', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(106, 14, '2024-12-14 00:22:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(107, 14, '2024-12-14 00:27:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(108, 14, '2024-12-14 00:38:08', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734019440735\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(109, 14, '2024-12-14 00:40:48', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(110, 14, '2024-12-14 00:47:38', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\n เพิ่มสารเคมี \"พรีวาธอน\" ไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(111, 14, '2024-12-14 00:57:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(112, 14, '2024-12-14 00:57:47', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243\n\n เพิ่มสารเคมี \"เเอซิดติก\" ไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(113, 14, '2024-12-14 01:00:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(114, 14, '2024-12-14 01:00:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(115, 14, '2024-12-14 01:03:17', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(116, 14, '2024-12-14 01:04:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(117, 14, '2024-12-14 01:04:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(118, 14, '2024-12-14 01:04:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(119, 14, '2024-12-14 01:04:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(120, 14, '2024-12-14 01:22:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(121, 14, '2024-12-14 01:22:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(122, 14, '2024-12-14 03:31:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(123, 14, '2024-12-14 03:31:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(124, 14, '2024-12-14 10:59:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(125, 14, '2024-12-14 10:59:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(126, 14, '2024-12-14 11:22:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(127, 14, '2024-12-14 11:22:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(128, 14, '2024-12-14 12:16:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(129, 14, '2024-12-14 12:16:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(130, 14, '2024-12-14 12:19:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(131, 14, '2024-12-14 12:19:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(132, 14, '2024-12-14 12:20:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243', '1'),
(133, 14, '2024-12-14 12:24:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(134, 14, '2024-12-14 12:27:31', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(135, 14, '2024-12-14 12:47:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1734154051562', '1'),
(136, 14, '2024-12-14 13:00:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734154051562\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(137, 14, '2024-12-14 13:00:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(138, 14, '2024-12-14 13:04:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734154051562\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(139, 14, '2024-12-14 13:04:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(140, 14, '2024-12-14 13:12:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734154051562\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(141, 14, '2024-12-14 13:12:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(142, 14, '2024-12-18 22:37:40', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733678502150\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(143, 14, '2024-12-18 22:37:40', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733678502150', '1'),
(144, 14, '2024-12-19 01:41:12', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(145, 14, '2024-12-19 01:41:12', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(146, 14, '2024-12-19 01:49:36', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(147, 14, '2024-12-19 01:49:36', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(148, 14, '2024-12-19 15:43:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(149, 14, '2024-12-19 18:01:23', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734154051562', '1'),
(150, 14, '2024-12-19 19:29:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734019440735', '1'),
(151, 14, '2024-12-19 20:30:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734019440735', '1'),
(152, 14, '2024-12-19 22:25:47', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(153, 14, '2024-12-20 17:37:23', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734019440735', '1'),
(154, 14, '2024-12-20 21:04:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(155, 14, '2024-12-20 21:05:31', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1734154051562', '1'),
(156, 14, '2024-12-20 21:49:53', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(157, 14, '2024-12-20 21:50:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(158, 14, '2024-12-20 22:01:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1734019440735', '1'),
(159, 14, '2024-12-20 22:02:24', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขปัจจัยการผลิต\nที่ฟอร์มไอดี 1734019440735', '1'),
(160, 14, '2024-12-20 22:03:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1734019440735', '1'),
(161, 14, '2024-12-20 22:03:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขปัจจัยการผลิต\nที่ฟอร์มไอดี 1734019440735', '1'),
(162, 14, '2024-12-20 22:03:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nทำการแก้ไขปัจจัยการผลิต\nที่ฟอร์มไอดี 1734019440735', '1'),
(163, 14, '2024-12-20 23:10:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 3', '1'),
(164, 14, '2024-12-20 23:11:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 27', '1'),
(165, 14, '2024-12-20 23:23:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734019440735\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(166, 14, '2024-12-20 23:23:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(167, 14, '2024-12-20 23:23:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734019440735', '1'),
(168, 14, '2024-12-20 23:26:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(169, 14, '2024-12-20 23:26:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(170, 14, '2024-12-20 23:28:42', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(171, 14, '2024-12-20 23:37:22', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\n✅ ข้อมูลสัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(172, 14, '2024-12-20 23:37:22', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(173, 14, '2024-12-20 23:39:15', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\n✅ ข้อมูลสัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(174, 14, '2024-12-20 23:39:15', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(175, 14, '2024-12-20 23:40:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\n✅ ข้อมูลสัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(176, 14, '2024-12-20 23:40:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(177, 14, '2024-12-20 23:45:36', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(178, 14, '2024-12-20 23:45:36', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(179, 14, '2024-12-20 23:47:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(180, 14, '2024-12-20 23:47:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(181, 14, '2024-12-20 23:56:47', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(182, 14, '2024-12-21 00:00:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(183, 14, '2024-12-21 00:00:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1733676361727', '1'),
(184, 14, '2024-12-21 00:04:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(185, 14, '2024-12-21 00:05:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(186, 14, '2024-12-21 00:09:22', '{\"3\": \"read\", \"1\": \"read\"}', '', '1'),
(187, 14, '2024-12-21 00:14:43', '{\"3\": \"read\", \"1\": \"read\"}', '', '1'),
(188, 14, '2024-12-21 00:20:11', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(189, 14, '2024-12-21 00:21:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(190, 14, '2024-12-21 00:24:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \nที่ฟอร์มไอดี 1734111648243', '1'),
(191, 14, '2024-12-21 00:25:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \nที่ฟอร์มไอดี 1734111648243', '1'),
(192, 14, '2024-12-21 00:26:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \nที่ฟอร์มไอดี 1734111648243', '1'),
(193, 14, '2024-12-21 00:26:49', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(194, 14, '2024-12-21 00:27:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(195, 14, '2024-12-21 00:27:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(196, 14, '2024-12-21 00:28:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(197, 14, '2024-12-21 00:28:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(198, 14, '2024-12-21 00:34:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(199, 14, '2024-12-21 00:36:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(200, 14, '2024-12-21 00:49:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี\nที่ฟอร์มไอดี 1734111648243\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(201, 14, '2024-12-21 00:49:30', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734111648243', '1'),
(202, 14, '2024-12-21 00:54:37', '{\"3\": \"read\", \"1\": \"read\"}', '', '1'),
(203, 14, '2024-12-21 00:56:31', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(204, 14, '2024-12-21 01:15:14', '{\"3\": \"read\", \"1\": \"read\"}', '', '1'),
(205, 14, '2024-12-21 01:19:33', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '1'),
(206, 14, '2024-12-21 01:19:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(207, 14, '2024-12-21 01:20:40', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '1'),
(208, 14, '2024-12-21 01:21:08', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(209, 14, '2024-12-21 01:22:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(210, 14, '2024-12-21 01:23:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '1'),
(211, 14, '2024-12-21 01:25:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 84', '1'),
(212, 14, '2024-12-21 01:26:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 84', '1'),
(213, 14, '2024-12-21 01:27:33', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 84', '1'),
(214, 14, '2024-12-21 15:51:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(215, 14, '2024-12-21 15:52:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(216, 14, '2024-12-21 15:52:35', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734771122928', '1'),
(217, 14, '2024-12-21 15:52:53', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734771122928', '1'),
(218, 14, '2024-12-21 15:53:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734771122928', '1'),
(219, 14, '2024-12-21 15:54:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734771122928', '1'),
(220, 14, '2024-12-21 15:55:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734771122928\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(221, 14, '2024-12-21 16:07:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734771122928\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(222, 14, '2024-12-21 16:07:41', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734771122928', '1'),
(223, 14, '2024-12-21 16:12:41', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 91', '1'),
(224, 14, '2024-12-21 16:13:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 91', '1'),
(225, 14, '2024-12-21 16:13:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 91', '1'),
(226, 14, '2024-12-21 17:09:09', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(227, 14, '2024-12-21 17:09:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '1'),
(228, 14, '2024-12-21 17:11:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(229, 14, '2024-12-21 17:39:17', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '1'),
(230, 14, '2024-12-21 17:39:48', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '1'),
(231, 14, '2024-12-21 17:40:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '1'),
(232, 14, '2024-12-21 19:46:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 51', '1'),
(233, 14, '2025-01-15 18:37:20', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734717391399', '2'),
(234, 14, '2025-01-15 18:38:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734717391399', '2'),
(235, 14, '2025-01-15 18:39:09', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1733676361727', '2'),
(236, 14, '2025-01-15 20:21:28', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(237, 14, '2025-01-15 20:23:01', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(238, 14, '2025-01-15 20:23:45', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1736947288113', '2'),
(239, 14, '2025-01-15 20:36:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1733676361727', '2'),
(240, 14, '2025-01-15 21:11:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 92', '2'),
(241, 14, '2025-01-15 23:28:09', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734771092810', '2'),
(242, 14, '2025-01-15 23:38:17', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734771092810', '2'),
(243, 14, '2025-01-15 23:42:57', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1734771092810', '2'),
(244, 14, '2025-01-16 01:25:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734771092810', '2'),
(245, 14, '2025-01-16 01:26:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734771092810\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"แมลงเต่าทอง\"', '2'),
(246, 14, '2025-01-16 01:27:24', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734771092810\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '2'),
(247, 14, '2025-01-16 13:31:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(248, 14, '2025-01-16 20:10:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1733676361727\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '2'),
(249, 14, '2025-01-18 21:19:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1737009104428', '2'),
(250, 14, '2025-01-18 23:21:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1737009104428\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '2'),
(251, 14, '2025-01-19 00:59:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1737009104428', '2'),
(252, 14, '2025-01-25 22:12:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1737009104428', '2'),
(253, 14, '2025-01-25 22:13:25', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 5', '2'),
(254, 14, '2025-01-25 22:15:47', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1737009104422', '2'),
(255, 14, '2025-01-26 00:26:43', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1737009104422\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนเจาะผล\"', '2'),
(256, 14, '2025-01-26 00:32:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 108', '2'),
(257, 14, '2025-01-26 00:33:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 5', '2'),
(258, 14, '2025-01-26 01:13:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(259, 14, '2025-01-26 10:24:06', '{\"1\": \"read\", \"3\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1737009104422\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"หนอนไฟ\"', '2'),
(260, 14, '2025-01-26 21:50:48', '{\"1\": \"read\", \"3\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"fff\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่ข้อมูลไม่สัมพันธ์กับศัตรูพืช \"เพลี้ยไฟ\"', '2'),
(261, 14, '2025-01-26 21:56:01', '{\"1\": \"read\", \"3\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '2'),
(262, 14, '2025-01-30 00:41:33', '{\"1\": \"read\", \"3\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1736947288113', '2'),
(263, 14, '2025-02-01 06:54:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 108', '2'),
(264, 14, '2025-02-01 07:25:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1737009104422', '2'),
(265, 14, '2025-02-01 07:32:47', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1737009104422', '2'),
(266, 14, '2025-02-01 07:33:36', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1737009104422', '2'),
(267, 14, '2025-02-01 07:58:41', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 108', '2'),
(268, 14, '2025-02-03 18:54:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1734717391399\n\nแต่สารเคมีไม่ตรงกับศัตรูพืช \"แมลงเต่าทอง\"', '2'),
(269, 14, '2025-02-03 19:21:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '2'),
(270, 14, '2025-02-03 19:23:11', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399', '2'),
(271, 14, '2025-02-03 19:23:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1734717391399\n\nสารเคมีไม่ตรงกับศัตรูพืช \"หนอนเจาะผล\"', '2'),
(272, 15, '2025-02-03 23:18:27', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(273, 14, '2025-02-04 00:21:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(274, 14, '2025-02-04 00:25:42', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(275, 14, '2025-02-04 00:27:12', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(276, 14, '2025-02-04 00:28:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(277, 14, '2025-02-04 00:29:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1738603709414', '2'),
(278, 14, '2025-02-04 00:30:24', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1738603709414', '2'),
(279, 14, '2025-02-04 00:34:23', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1738603709414\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '2'),
(280, 14, '2025-02-04 00:38:45', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1738603632835', '2'),
(281, 14, '2025-02-04 00:40:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอซิดติก\"\nที่ฟอร์มไอดี 1738603286610\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '2'),
(282, 14, '2025-02-04 00:42:00', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1738603286610', '2'),
(283, 16, '2025-02-06 00:27:47', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(284, 14, '2025-02-07 15:16:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(285, 14, '2025-02-07 15:18:33', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1738916192668\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '2'),
(286, 14, '2025-02-07 20:08:27', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(287, 12, '2025-02-07 20:22:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม มีการเพิ่มแบบบันทึก', '1'),
(288, 14, '2025-02-07 20:23:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '2'),
(289, 12, '2025-02-07 20:28:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1738934534064', '1'),
(290, 12, '2025-02-07 20:29:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 6', '1'),
(291, 12, '2025-02-07 20:30:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1738934534064', '1'),
(292, 12, '2025-02-07 20:40:38', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1738934534064', '1'),
(293, 12, '2025-02-07 20:44:08', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1738934534064\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(294, 14, '2025-02-08 00:42:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1738916192668', '1'),
(295, 14, '2025-02-08 00:43:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1738916192668\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(296, 14, '2025-02-08 00:59:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 123', '1'),
(297, 14, '2025-02-09 00:40:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(298, 14, '2025-02-09 00:48:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(299, 14, '2025-02-09 01:04:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(300, 14, '2025-02-09 01:17:20', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(301, 14, '2025-02-09 19:21:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(302, 14, '2025-02-09 19:56:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(303, 14, '2025-02-09 20:09:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739105767567', '1'),
(304, 14, '2025-02-09 20:10:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739105767567\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '1'),
(305, 14, '2025-02-09 21:11:49', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(306, 14, '2025-02-10 04:52:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(307, 14, '2025-02-10 05:26:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(308, 14, '2025-02-10 06:19:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(309, 14, '2025-02-10 07:02:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(310, 14, '2025-02-10 07:02:25', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739145724923\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(311, 14, '2025-02-10 07:02:43', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(312, 14, '2025-02-10 07:16:11', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739145762888\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(313, 14, '2025-02-10 07:58:56', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(314, 14, '2025-02-10 18:28:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1738934585074', '1'),
(315, 14, '2025-02-10 18:29:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(316, 14, '2025-02-10 18:33:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(317, 14, '2025-02-10 19:11:48', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 129', '1'),
(318, 14, '2025-02-10 19:14:08', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(319, 14, '2025-02-10 19:19:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739189648597', '1'),
(320, 14, '2025-02-10 19:19:31', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 130', '1'),
(321, 14, '2025-02-10 20:26:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(322, 14, '2025-02-10 20:59:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739193976397\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '1'),
(323, 14, '2025-02-10 21:00:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739193976397\n\nสารเคมีไม่ตรงกับศัตรูพืช \"หนอนกระทู้ผัก\"', '1'),
(324, 14, '2025-02-10 21:00:17', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอคทารา\"\nที่ฟอร์มไอดี 1739193976397\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(325, 14, '2025-02-10 21:00:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(326, 14, '2025-02-10 21:03:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(327, 14, '2025-02-10 21:26:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(328, 14, '2025-02-10 21:29:17', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(329, 14, '2025-02-10 21:56:43', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739197757792\n\nสารเคมีไม่ตรงกับศัตรูพืช \"หนอนชอนใบ\"', '1'),
(330, 14, '2025-02-10 21:56:58', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเอคทารา\"\nที่ฟอร์มไอดี 1739197757792\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(331, 14, '2025-02-10 22:02:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(332, 14, '2025-02-10 22:03:11', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(333, 14, '2025-02-10 22:32:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1');
INSERT INTO `notify_doctor` (`id`, `id_table_farmer`, `date`, `id_read`, `notify`, `station`) VALUES
(334, 14, '2025-02-10 22:44:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739201526385', '1'),
(335, 14, '2025-02-10 22:53:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739201526385', '1'),
(336, 14, '2025-02-10 23:24:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 135', '1'),
(337, 14, '2025-02-10 23:25:48', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739197757792\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(338, 14, '2025-02-10 23:26:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(339, 14, '2025-02-10 23:26:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739204770858', '1'),
(340, 14, '2025-02-12 19:07:20', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(341, 14, '2025-02-12 19:07:48', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739362040035', '1'),
(342, 14, '2025-02-12 19:08:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739362040035\n\nสารเคมีไม่ตรงกับโรคพืช \"ราเเป้ง\"', '1'),
(343, 14, '2025-02-12 19:08:28', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739362040035\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '1'),
(344, 14, '2025-02-12 19:09:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739362040035', '1'),
(345, 14, '2025-02-12 19:09:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(346, 14, '2025-02-12 19:27:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(347, 14, '2025-02-12 19:44:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(348, 14, '2025-02-12 19:45:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(349, 14, '2025-02-12 19:49:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(350, 14, '2025-02-12 20:13:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(351, 14, '2025-02-12 20:33:42', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(352, 14, '2025-02-12 20:36:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(353, 14, '2025-02-12 20:37:11', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(354, 14, '2025-02-12 20:44:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739367431009', '1'),
(355, 14, '2025-02-12 20:50:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(356, 14, '2025-02-12 20:51:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(357, 14, '2025-02-12 20:57:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(358, 14, '2025-02-12 20:57:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(359, 14, '2025-02-12 21:00:45', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739368675906', '1'),
(360, 14, '2025-02-12 21:01:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(361, 14, '2025-02-12 21:14:56', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(362, 14, '2025-02-12 21:15:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(363, 14, '2025-02-12 21:30:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739369718606', '1'),
(364, 14, '2025-02-12 21:30:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739369718606\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(365, 14, '2025-02-12 21:52:07', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739369718606', '1'),
(366, 14, '2025-02-12 21:53:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(367, 14, '2025-02-12 21:53:18', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739371982912', '1'),
(368, 14, '2025-02-12 22:19:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739371982912\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(369, 14, '2025-02-12 22:19:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739371982912\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(370, 14, '2025-02-12 22:20:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(371, 14, '2025-02-12 22:28:23', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(372, 14, '2025-02-12 22:30:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739374103574', '1'),
(373, 14, '2025-02-12 22:31:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(374, 14, '2025-02-12 22:35:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(375, 14, '2025-02-13 00:26:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(376, 14, '2025-02-13 00:27:37', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(377, 14, '2025-02-13 14:28:56', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739374504183', '1'),
(378, 14, '2025-02-13 14:29:43', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"เเม็กต้า\"\nที่ฟอร์มไอดี 1739374504183\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(379, 12, '2025-02-13 15:07:39', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม มีการเพิ่มแบบบันทึก', '1'),
(380, 12, '2025-02-13 15:15:42', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739434059772', '1'),
(381, 12, '2025-02-13 15:19:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม มีการเพิ่มแบบบันทึก', '1'),
(382, 12, '2025-02-13 15:25:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739434059772', '1'),
(383, 12, '2025-02-13 15:28:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739434059772\n\nสารเคมีไม่ตรงกับศัตรูพืช \"หนอนใยผัก\"', '1'),
(384, 14, '2025-02-14 19:15:03', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(385, 14, '2025-02-14 19:21:11', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(386, 14, '2025-02-14 19:33:44', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(387, 14, '2025-02-14 19:36:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(388, 14, '2025-02-14 19:37:22', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(389, 14, '2025-02-14 19:39:02', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(390, 14, '2025-02-14 20:03:22', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 145', '1'),
(391, 14, '2025-02-14 20:05:36', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 145', '1'),
(392, 14, '2025-02-14 20:17:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(393, 14, '2025-02-14 20:27:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(394, 14, '2025-02-14 20:30:52', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(395, 14, '2025-02-14 20:35:12', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 145', '1'),
(396, 14, '2025-02-14 20:39:38', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(397, 14, '2025-02-14 20:59:14', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(398, 14, '2025-02-14 20:59:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(399, 14, '2025-02-14 21:25:50', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(400, 14, '2025-02-14 21:26:21', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(401, 14, '2025-02-14 21:31:46', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(402, 14, '2025-02-14 21:31:59', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(403, 14, '2025-02-14 23:21:41', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 145', '1'),
(404, 14, '2025-02-14 23:32:35', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(405, 14, '2025-02-15 00:31:29', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739374504183', '1'),
(406, 14, '2025-02-16 16:01:04', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374265887', '1'),
(407, 14, '2025-02-16 16:34:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(408, 14, '2025-02-16 22:54:00', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739698466666\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(409, 14, '2025-02-17 02:58:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739698466666', '1'),
(410, 14, '2025-02-17 12:56:34', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(411, 14, '2025-02-17 12:57:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739771794945', '1'),
(412, 14, '2025-02-17 12:57:41', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739771794945\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(413, 14, '2025-02-17 12:58:15', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 150', '1'),
(414, 14, '2025-02-17 14:10:16', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(415, 14, '2025-02-17 14:10:35', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"คาร์ดาซิม\"\nที่ฟอร์มไอดี 1739776216034\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(416, 14, '2025-02-17 14:11:19', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 151', '1'),
(417, 14, '2025-02-17 14:11:40', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739776216034', '1'),
(418, 14, '2025-02-17 14:11:51', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 10', '1'),
(419, 14, '2025-02-17 19:17:05', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739776216034', '1'),
(420, 14, '2025-02-17 20:06:10', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(421, 14, '2025-02-17 20:06:48', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739797570772', '1'),
(422, 14, '2025-02-17 20:07:38', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739797570772\n\nไม่สามารถตรวจสอบสารเคมีกับศัตรูพืชได้', '1'),
(423, 14, '2025-02-17 20:07:55', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 153', '1'),
(424, 17, '2025-02-18 01:44:52', '{\"3\": \"read\", \"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(425, 17, '2025-02-18 01:57:31', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(426, 17, '2025-02-18 01:58:06', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739818651635', '1'),
(427, 17, '2025-02-18 02:01:54', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739818651635\n\nไม่สามารถตรวจสอบสารเคมีกับศัตรูพืชได้', '1'),
(428, 17, '2025-02-18 02:04:13', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มสารเคมี \"เเม็กต้า\"\nที่ฟอร์มไอดี 1739818651635\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '1'),
(429, 17, '2025-02-18 02:05:57', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 155', '1'),
(430, 17, '2025-02-18 02:06:22', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739818651635', '1'),
(431, 17, '2025-02-18 02:06:31', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 11', '1'),
(432, 17, '2025-02-18 02:39:26', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(433, 17, '2025-02-18 02:39:49', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739821166754\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยอ่อน\"', '1'),
(434, 17, '2025-02-18 02:40:32', '{\"3\": \"read\", \"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(435, 17, '2025-02-18 23:23:29', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มสารเคมี \"เเม็กต้า\"\nที่ฟอร์มไอดี 1739818651635\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '1'),
(436, 17, '2025-02-19 00:02:15', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739821232743\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(437, 17, '2025-02-19 00:43:28', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(438, 14, '2025-02-19 01:51:22', '{\"1\": \"read\"}', 'เกษตรกร บุษ ศรี ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739374504183', '1'),
(439, 14, '2025-02-19 02:07:30', '{\"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(440, 14, '2025-02-19 02:29:48', '{\"1\": \"read\"}', 'เกษตรกร บุษ ศรี มีการเพิ่มแบบบันทึก', '1'),
(441, 18, '2025-02-19 16:12:52', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(442, 19, '2025-02-19 16:13:38', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(443, 20, '2025-02-19 16:14:19', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(444, 21, '2025-02-19 16:16:14', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(445, 19, '2025-02-19 16:25:14', '{\"1\": \"read\"}', 'เกษตรกร ธีรวัฒน์ บริสุทธิ์ มีการเพิ่มแบบบันทึก', '1'),
(446, 20, '2025-02-19 16:25:58', '{\"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม มีการเพิ่มแบบบันทึก', '1'),
(447, 22, '2025-02-19 16:26:09', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(448, 18, '2025-02-19 16:26:12', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ มีการเพิ่มแบบบันทึก', '1'),
(449, 21, '2025-02-19 16:27:11', '{\"1\": \"read\"}', 'เกษตรกร ณัฐวุฒิ มาลากอง มีการเพิ่มแบบบันทึก', '1'),
(450, 19, '2025-02-19 16:27:39', '{\"1\": \"read\"}', 'เกษตรกร ธีรวัฒน์ บริสุทธิ์\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739957114825', '1'),
(451, 18, '2025-02-19 16:28:05', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739957172333', '1'),
(452, 20, '2025-02-19 16:29:27', '{\"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739957158454', '1'),
(453, 21, '2025-02-19 16:30:34', '{\"1\": \"read\"}', 'เกษตรกร ณัฐวุฒิ มาลากอง\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739957231857', '1'),
(454, 18, '2025-02-19 16:31:40', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ\nมีการเพิ่มสารเคมี \"โมแลน\"\nที่ฟอร์มไอดี 1739957172333\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยอ่อน\"', '1'),
(455, 19, '2025-02-19 16:32:01', '{\"1\": \"read\"}', 'เกษตรกร ธีรวัฒน์ บริสุทธิ์\nมีการเพิ่มสารเคมี \"โมแลน\"\nที่ฟอร์มไอดี 1739957114825\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(456, 20, '2025-02-19 16:32:18', '{\"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1739957158454\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยอ่อน\"', '1'),
(457, 21, '2025-02-19 16:33:54', '{\"1\": \"read\"}', 'เกษตรกร ณัฐวุฒิ มาลากอง\nมีการเพิ่มสารเคมี \"เเม็กต้า\"\nที่ฟอร์มไอดี 1739957231857\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(458, 19, '2025-02-19 16:34:09', '{\"1\": \"read\"}', 'เกษตรกร ธีรวัฒน์ บริสุทธิ์\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739957114825', '1'),
(459, 20, '2025-02-19 16:34:19', '{\"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มสารเคมี \"เเม็กต้า\"\nที่ฟอร์มไอดี 1739957158454\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยเเป้ง\"', '1'),
(460, 18, '2025-02-19 16:35:26', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739957172333', '1'),
(461, 21, '2025-02-19 16:35:43', '{\"1\": \"read\"}', 'เกษตรกร ณัฐวุฒิ มาลากอง\nมีการเพิ่มสารเคมี \"เเอคทารา\"\nที่ฟอร์มไอดี 1739957231857\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(462, 17, '2025-02-19 16:36:51', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(463, 21, '2025-02-19 16:37:46', '{\"1\": \"read\"}', 'เกษตรกร ณัฐวุฒิ มาลากอง\nมีการเพิ่มสารเคมี \"เเม็กต้า\"\nที่ฟอร์มไอดี 1739957231857\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(464, 20, '2025-02-19 16:39:58', '{\"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม มีการเพิ่มแบบบันทึก', '1'),
(465, 20, '2025-02-19 16:41:33', '{\"1\": \"read\"}', 'เกษตรกร ธนสิน บุญนาม\nมีการเพิ่มสารเคมี \"โมแลน\"\nที่ฟอร์มไอดี 1739957998859\n\nสารเคมีไม่ตรงกับศัตรูพืช \"เพลี้ยไฟ\"', '1'),
(466, 21, '2025-02-19 16:42:03', '{\"1\": \"read\"}', 'เกษตรกร ณัฐวุฒิ มาลากอง\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739957231857', '1'),
(467, 18, '2025-02-19 16:43:04', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ มีการเพิ่มแบบบันทึก', '1'),
(468, 18, '2025-02-19 16:43:55', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739958184613', '1'),
(469, 18, '2025-02-19 16:45:00', '{\"1\": \"read\"}', 'เกษตรกร นภัสสร แก้วไพ\nมีการเพิ่มสารเคมี \"เเอคทารา\"\nที่ฟอร์มไอดี 1739958184613\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบไหม้\"', '1'),
(470, 17, '2025-02-19 23:02:33', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง\nมีการเพิ่มสารเคมี \"พรีวาธอน\"\nที่ฟอร์มไอดี 1739957811027\n\nสารเคมีไม่ตรงกับโรคพืช \"ใบจุด\"', '1'),
(471, 23, '2025-02-19 23:02:55', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(472, 23, '2025-02-19 23:07:13', '{\"1\": \"read\"}', 'เกษตรกร พชรพล สวัสดี มีการเพิ่มแบบบันทึก', '1'),
(473, 17, '2025-02-19 23:14:30', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(474, 17, '2025-02-19 23:15:51', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(475, 17, '2025-02-20 00:18:12', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(476, 17, '2025-02-20 00:18:53', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(477, 17, '2025-02-20 00:19:29', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(478, 17, '2025-02-20 00:19:47', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง มีการเพิ่มแบบบันทึก', '1'),
(479, 24, '2025-02-20 01:00:07', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '2'),
(480, 24, '2025-02-20 01:02:24', '{\"1\": \"read\"}', 'เกษตรกร บุษ ศรีสัน มีการเพิ่มแบบบันทึก', '2'),
(481, 25, '2025-02-20 01:37:32', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(482, 14, '2025-02-20 01:53:27', '{\"1\": \"read\"}', 'เกษตรกร บุษ ศรี\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1739374265887', '1'),
(483, 17, '2025-02-21 01:43:33', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739985587508', '1'),
(484, 17, '2025-02-21 01:45:07', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739985587508', '1'),
(485, 17, '2025-02-21 19:32:10', '{\"1\": \"read\"}', 'เกษตรกร บุษ บง ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1739985587508', '1'),
(486, 26, '2025-03-21 15:05:49', '{\"1\": \"read\"}', 'มีเกษตรกรสมัครบัญชีเข้ามาใหม่', '1'),
(487, 26, '2025-03-21 15:22:46', '{\"1\": \"read\"}', 'เกษตรกร บุษบง ศรีสุข มีการเพิ่มแบบบันทึก', '1'),
(488, 26, '2025-03-21 15:27:27', '{\"1\": \"read\"}', 'เกษตรกร บุษบง ศรีสุข ทำการแก้ไขแบบฟอร์มบันทึกข้อมูล\nรหัสแบบฟอร์ม 1742545366203', '1'),
(489, 26, '2025-03-21 15:32:12', '{\"1\": \"read\"}', 'เกษตรกร บุษบง ศรีสุข\nมีการเพิ่มสารเคมี \"ไดเทน\"\nที่ฟอร์มไอดี 1742545366203', '1'),
(490, 26, '2025-03-21 15:33:31', '{\"1\": \"read\"}', 'เกษตรกร บุษบง ศรีสุข ทำการแก้ไขสารเคมี\nรหัสฟอร์ม 169', '1'),
(491, 26, '2025-03-21 15:34:56', '{\"1\": \"read\"}', 'เกษตรกร บุษบง ศรีสุข\nมีการเพิ่มปัจจัยการผลิต\nที่ฟอร์มไอดี 1742545366203', '1'),
(492, 26, '2025-03-21 15:35:47', '{\"1\": \"read\"}', 'เกษตรกร บุษบง ศรีสุข ทำการแก้ไขปัจจัยการผลิต\nรหัสฟอร์ม 20', '1');

-- --------------------------------------------------------

--
-- Table structure for table `pests`
--

CREATE TABLE `pests` (
  `pest_id` int(11) NOT NULL,
  `pest_name` varchar(255) NOT NULL,
  `type_pest` varchar(50) DEFAULT NULL,
  `is_use` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `pests`
--

INSERT INTO `pests` (`pest_id`, `pest_name`, `type_pest`, `is_use`) VALUES
(1, 'หนอนชอนใบ', 'ศัตรูพืช', 1),
(2, 'หนอนกระทู้ผัก', 'ศัตรูพืช', 1),
(3, 'เพลี้ยเเป้ง', 'ศัตรูพืช', 1),
(7, 'ใบจุด', 'โรคพืช', 1),
(11, 'ราเเป้ง', 'โรคพืช', 1),
(12, 'เพลี้ยอ่อน', 'ศัตรูพืช', 1),
(13, 'หนอนใยผัก', 'ศัตรูพืช', 1),
(14, 'เพลี้ยไฟ', 'ศัตรูพืช', 0),
(15, 'ใบไหม้', 'โรคพืช', 0);

-- --------------------------------------------------------

--
-- Table structure for table `pest_chemical`
--

CREATE TABLE `pest_chemical` (
  `id` int(11) NOT NULL,
  `pest_id` int(11) NOT NULL,
  `chemical_id` int(11) NOT NULL,
  `plant_id` int(11) DEFAULT NULL,
  `safe_days` int(11) DEFAULT 0,
  `status` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `pest_chemical`
--

INSERT INTO `pest_chemical` (`id`, `pest_id`, `chemical_id`, `plant_id`, `safe_days`, `status`) VALUES
(1, 1, 1, 19, 11, 1),
(2, 7, 2, 30, 14, 1),
(3, 7, 6, 29, 14, 1),
(4, 1, 7, 28, 24, 1),
(5, 1, 1, 24, 11, 1),
(6, 11, 9, 26, 15, 1),
(8, 2, 1, 25, 11, 1),
(9, 12, 8, 24, 25, 1),
(10, 7, 9, 23, 15, 1),
(11, 13, 1, 22, 11, 1),
(12, 14, 2, 21, 14, 1),
(13, 15, 6, 20, 14, 1),
(14, 7, 9, 15, 15, 1),
(15, 15, 9, 14, 15, 1),
(16, 15, 9, 17, 15, 1),
(17, 15, 7, 14, 24, 1),
(18, 15, 11, 14, 10, 1),
(19, 14, 2, 27, 14, 1),
(20, 2, 7, 18, 24, 1);

-- --------------------------------------------------------

--
-- Table structure for table `plant_list`
--

CREATE TABLE `plant_list` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `variety_name` varchar(255) NOT NULL,
  `is_use` tinyint(1) NOT NULL,
  `type_plant` varchar(20) NOT NULL,
  `qty_harvest` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `plant_list`
--

INSERT INTO `plant_list` (`id`, `name`, `variety_name`, `is_use`, `type_plant`, `qty_harvest`) VALUES
(14, 'เรดคอส', 'สีเเดง', 1, 'พืชผัก', 45),
(15, 'เรดคอส', 'สีเขียว', 1, 'พืชผัก', 40),
(17, 'มะเขือเทศ', '', 1, 'พืชผัก', 90),
(18, 'เมล่อน', '', 1, 'พืชผัก', 60),
(19, 'สตรอว์เบอร์รี่', '', 1, 'พืชผัก', 35),
(20, 'โรสแมรี่', '', 1, 'พืชผัก', 120),
(21, 'กะหล่ำปม', '', 1, 'พืชผัก', 60),
(22, 'แรดิช', '', 1, 'พืชผัก', 20),
(23, 'ผักกาดขาวปลี', '', 1, 'พืชผัก', 45),
(24, 'มะเขือเทศเชอร์รี่', '', 1, 'พืชผัก', 85),
(25, 'ขึ้นฉ่าย', '', 1, 'พืชผัก', 20),
(26, 'อะโวคาโด', '', 1, 'พืชผัก', 160),
(27, 'กะหล่ำปลี', '', 1, 'พืชผัก', 90),
(28, 'ฟ้าทะลายโจร', '', 1, 'สมุนไพร', 10),
(29, 'กระเทียม', '', 1, 'สมุนไพร', 90),
(30, 'หัวหอม', '', 1, 'สมุนไพร', 20);

-- --------------------------------------------------------

--
-- Table structure for table `record_edit`
--

CREATE TABLE `record_edit` (
  `id_record_edit` int(11) NOT NULL,
  `edit_date` datetime NOT NULL,
  `report_text` longtext NOT NULL,
  `image_path` varchar(100) NOT NULL,
  `id_report_detail` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `report_detail`
--

CREATE TABLE `report_detail` (
  `id` int(11) NOT NULL,
  `id_plant` varchar(50) NOT NULL,
  `report_text` longtext NOT NULL,
  `id_table_doctor` int(11) NOT NULL,
  `date_report` datetime NOT NULL DEFAULT current_timestamp(),
  `image_path` varchar(100) NOT NULL,
  `is_read` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `report_detail`
--

INSERT INTO `report_detail` (`id`, `id_plant`, `report_text`, `id_table_doctor`, `date_report`, `image_path`, `is_read`) VALUES
(3, '1738603709414', 'เพิ่มปุ๋ยเเละเพิ่มการลดน้ำ', 3, '2025-02-06 14:58:02', '', 0),
(4, '1738603709414', 'เเก้ไขสารเคมี', 3, '2025-02-06 15:02:40', '', 0),
(5, '1738934534064', 'เพิ่มปุ๋ยตรากระต่าย 15-15-15', 3, '2025-02-07 21:00:28', '', 0),
(6, '1739374265887', 'รดน้ำเพิ่ม', 3, '2025-02-13 00:48:42', '', 1),
(7, '1739434059772', 'รดน้ำน้อยลง', 3, '2025-02-13 15:31:16', '', 0),
(8, '1739374103574', 'ใส่ปุ๋ยเพิ่มเติม', 3, '2025-02-13 18:24:37', '', 0),
(9, '1739374103574', 'รดน้ำ', 3, '2025-02-13 18:28:25', '', 0),
(10, '1739374103574', 'ใส่สารเคมี', 3, '2025-02-13 18:28:41', '', 0),
(11, '1739374504183', 'รดน้ำน้อย', 3, '2025-02-13 19:07:16', '', 1),
(12, '1739698466666', '123', 3, '2025-02-18 13:48:23', '317396984666661739861303713.jpg', 0),
(13, '1739698466666', '123', 3, '2025-02-18 13:48:25', '317396984666661739861305659.jpg', 0),
(14, '1739818651635', 'ดี', 3, '2025-02-18 13:50:56', '317398186516351739861456768.jpg', 1),
(15, '1739818651635', 'ดี', 3, '2025-02-18 13:50:57', '317398186516351739861457548.jpg', 1),
(16, '1739818651635', 'ดี', 3, '2025-02-18 13:51:08', '317398186516351739861468921.jpg', 1),
(17, '1739818651635', 'ดี', 3, '2025-02-18 13:51:08', '317398186516351739861468925.jpg', 1),
(18, '1739189648597', 'ใส่สารเคมีพรีวาธอน', 3, '2025-02-18 14:17:05', '', 0),
(19, '1739957811027', 'เพิ่มการรดน้ำ', 1, '2025-02-22 23:33:22', '', 1),
(20, '1739985533428', 'ใส่ปุ๋ยเพิ่ม', 1, '2025-02-22 23:44:23', '', 1),
(21, '1742545366203', 'เพิ่มการใส่ปุ๋ย', 1, '2025-03-21 21:58:01', '', 1);

-- --------------------------------------------------------

--
-- Table structure for table `sensor_weather_greenhouse`
--

CREATE TABLE `sensor_weather_greenhouse` (
  `id` int(11) NOT NULL,
  `device_id` varchar(50) NOT NULL,
  `greenhouse_id` int(11) NOT NULL,
  `status` enum('on','off') NOT NULL DEFAULT 'on',
  `create_timestamp` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sensor_weather_station`
--

CREATE TABLE `sensor_weather_station` (
  `id` int(11) NOT NULL,
  `device_id` varchar(50) NOT NULL,
  `station_signature` varchar(255) NOT NULL,
  `status` enum('on','off') NOT NULL DEFAULT 'on',
  `create_timestamp` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `source_list`
--

CREATE TABLE `source_list` (
  `id` int(11) NOT NULL,
  `name` varchar(80) NOT NULL,
  `is_use` tinyint(1) NOT NULL,
  `location` point DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `source_list`
--

INSERT INTO `source_list` (`id`, `name`, `is_use`, `location`) VALUES
(1, 'สหกรณ์คลองหก', 1, NULL),
(2, 'สหกรณ์คลองหลวง', 1, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `station_list`
--

CREATE TABLE `station_list` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `is_use` tinyint(1) NOT NULL,
  `location` point NOT NULL,
  `id_station` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `station_list`
--

INSERT INTO `station_list` (`id`, `name`, `is_use`, `location`, `id_station`) VALUES
(1, 'ศูนย์พัฒนาโครงการหลวงหนองเขียว', 1, 0x00000000010100000054d856fd5b132c40b5e78dee7b2f5940, '123'),
(2, 'ศูนย์พัฒนาโครงการหลวงห้วยลึก', 1, 0x0000000001010000003d2cd49ae64759404182e2c7985b2b40, '345');

-- --------------------------------------------------------

--
-- Table structure for table `statistic`
--

CREATE TABLE `statistic` (
  `id` int(11) NOT NULL,
  `id_role` varchar(20) NOT NULL,
  `role` varchar(20) NOT NULL,
  `count_day` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `statistic`
--

INSERT INTO `statistic` (`id`, `id_role`, `role`, `count_day`) VALUES
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 0),
(0, '4', 'admin', 0),
(0, '1', 'doctor', 1),
(0, '1', 'doctor', 0),
(0, '1', 'doctor', 0),
(0, '1', 'acc_doctor', 0),
(0, '1', 'doctor', 6),
(0, '1', 'doctor', 3),
(0, '1', 'doctor', 2),
(0, '1', 'doctor', 0),
(0, '2', 'admin', 0),
(0, '2', 'admin', 2),
(0, '2', 'admin', 0),
(0, '1', 'doctor', 2),
(0, '1', 'doctor', 1),
(0, '1', 'doctor', 0),
(0, '1', 'doctor', 3),
(0, '1', 'doctor', 0),
(0, '1', 'doctor', 0);

-- --------------------------------------------------------

--
-- Table structure for table `success_detail`
--

CREATE TABLE `success_detail` (
  `id` int(11) NOT NULL,
  `id_success` varchar(100) NOT NULL,
  `id_plant` varchar(50) NOT NULL,
  `type_success` tinyint(1) NOT NULL,
  `id_table_doctor` int(11) NOT NULL,
  `date_of_doctor` datetime NOT NULL DEFAULT current_timestamp(),
  `date_of_farmer` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `success_detail`
--

INSERT INTO `success_detail` (`id`, `id_success`, `id_plant`, `type_success`, `id_table_doctor`, `date_of_doctor`, `date_of_farmer`) VALUES
(9, '8897', '1738934534064', 0, 3, '2025-02-07 20:54:37', '2025-02-07 21:12:31.506'),
(10, '4431', '1738934534064', 0, 3, '2025-02-07 21:12:47', '2025-02-07 21:13:14.727'),
(11, '1376', '1738916192668', 0, 3, '2025-02-07 21:36:41', '2025-02-07 21:38:14.011'),
(12, '8047', '1739105767567', 0, 3, '2025-02-09 21:36:47', '2025-02-09 21:44:36.552'),
(13, '6043', '1739105767567', 0, 3, '2025-02-09 22:02:45', '2025-02-09 23:02:15.375'),
(14, '6964', '1739105767567', 0, 3, '2025-02-09 22:59:10', '2025-02-09 23:28:03.960'),
(15, '0282', '1739110309598', 0, 3, '2025-02-09 23:35:49', '2025-02-10 00:20:07.089'),
(16, '5228', '1739110309598', 0, 3, '2025-02-10 00:10:18', '2025-02-10 00:20:10.257'),
(17, '4517', '1739110309598', 0, 3, '2025-02-10 00:51:32', '2025-02-10 03:17:04.984'),
(18, '1517', '1739374265887', 0, 3, '2025-02-13 00:48:21', '2025-02-13 00:51:02.899'),
(19, '8837', '1739374265887', 1, 3, '2025-02-13 04:08:48', '2025-02-13 04:33:52.929'),
(20, '7076', '1739434059772', 0, 3, '2025-02-13 15:30:27', '2025-02-13 15:33:44.362'),
(21, '2496', '1739434059772', 0, 3, '2025-02-13 15:40:44', '2025-02-13 15:41:36.784'),
(22, '7056', '1739374103574', 0, 3, '2025-02-13 17:08:06', '2025-02-13 17:08:25.690'),
(23, '2086', '1739374103574', 0, 3, '2025-02-13 17:25:37', '2025-02-13 17:25:50.419'),
(24, '1132', '1739374103574', 0, 3, '2025-02-13 17:30:18', '2025-02-13 17:30:27.611'),
(25, '2426', '1739374103574', 0, 3, '2025-02-13 17:32:11', '2025-02-13 17:32:21.859'),
(26, '6360', '1739374103574', 0, 3, '2025-02-13 17:35:50', '2025-02-13 17:36:03.909'),
(27, '1402', '1739374103574', 0, 3, '2025-02-13 18:00:14', '2025-02-13 18:15:16.000'),
(28, '2804', '1739374103574', 0, 3, '2025-02-13 18:23:56', '2025-02-13 18:43:37.909'),
(29, '0087', '1739374103574', 1, 3, '2025-02-13 18:38:50', '2025-02-13 18:43:34.015'),
(30, '2665', '1739374504183', 0, 3, '2025-02-13 19:04:40', '2025-02-13 19:08:57.791'),
(31, '3865', '1739374504183', 0, 3, '2025-02-13 19:05:25', '2025-02-13 19:08:29.661'),
(32, '8781', '1739374504183', 0, 3, '2025-02-13 19:11:20', '2025-02-13 19:11:41.167'),
(33, '0123', '1739374504183', 0, 3, '2025-02-13 19:11:26', '2025-02-13 19:11:35.813'),
(34, '3846', '1739957114825', 0, 1, '2025-02-19 16:46:40', '2025-02-19 16:49:57.398'),
(35, '1932', '1739957158454', 0, 1, '2025-02-19 16:47:48', '2025-02-19 16:52:31.861'),
(36, '1600', '1739957172333', 0, 1, '2025-02-19 16:48:09', '2025-02-19 16:50:03.415'),
(37, '8257', '1739957158454', 1, 1, '2025-02-19 17:16:47', '2025-02-19 17:17:15.052'),
(38, '7053', '1739957172333', 1, 1, '2025-02-19 17:17:10', '2025-02-19 17:17:26.417'),
(39, '2458', '1739957114825', 1, 1, '2025-02-19 17:17:30', ''),
(40, '4113', '1739957811027', 0, 1, '2025-02-22 23:33:36', '2025-02-22 23:47:19.466'),
(41, '1374', '1742545366203', 0, 1, '2025-03-21 21:52:11', '2025-03-21 21:54:02.898'),
(42, '5572', '1742545366203', 1, 1, '2025-03-21 22:06:36', '2025-03-21 22:09:32.384');

-- --------------------------------------------------------

--
-- Table structure for table `varieties`
--

CREATE TABLE `varieties` (
  `variety_id` int(11) NOT NULL,
  `plant_id` int(11) DEFAULT NULL,
  `variety_name` varchar(50) NOT NULL,
  `dates` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `weather_greenhouse`
--

CREATE TABLE `weather_greenhouse` (
  `id` int(11) NOT NULL,
  `device_id` varchar(50) DEFAULT NULL,
  `timestamp` datetime DEFAULT NULL,
  `air_temperature` float DEFAULT NULL,
  `air_humidity` float DEFAULT NULL,
  `light` float DEFAULT NULL,
  `soil_temperature` float DEFAULT NULL,
  `soil_humidity` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `weather_station`
--

CREATE TABLE `weather_station` (
  `id` int(11) NOT NULL,
  `device_id` varchar(50) DEFAULT NULL,
  `timestamp` datetime NOT NULL DEFAULT current_timestamp(),
  `temperature` double DEFAULT NULL,
  `humidity` double DEFAULT NULL,
  `light` double DEFAULT NULL,
  `rainfall` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `weather_station`
--

INSERT INTO `weather_station` (`id`, `device_id`, `timestamp`, `temperature`, `humidity`, `light`, `rainfall`) VALUES
(138, 'dev-001', '2025-03-15 15:14:01', 32.1, 42, 150.3, 2.2),
(139, 'dev-001', '2025-04-13 07:15:47', 32, 73, 68.8, 8.6),
(140, 'dev-001', '2025-03-01 11:40:13', 35.5, 77, 50.9, 7.9),
(141, 'dev-001', '2025-02-26 11:52:40', 31.6, 57, 99.3, 5.1),
(142, 'dev-001', '2025-03-18 12:39:16', 34.3, 52, 152, 6.7),
(143, 'dev-001', '2025-03-12 08:07:06', 29.5, 58, 140.9, 3.7),
(144, 'dev-001', '2025-02-10 05:09:44', 29.8, 64, 60.6, 4.8),
(145, 'dev-001', '2025-03-10 08:35:09', 28.9, 43, 189.4, 6.1),
(146, 'dev-001', '2025-02-09 20:34:42', 32.6, 63, 191.5, 9.6),
(147, 'dev-001', '2025-01-30 16:57:03', 33.7, 49, 193.4, 6.1),
(148, 'dev-001', '2025-01-28 12:57:29', 29.6, 72, 103.7, 2.1),
(149, 'dev-001', '2025-01-30 14:10:35', 30.1, 45, 174.7, 7.7),
(150, 'dev-001', '2025-03-08 05:22:43', 34.3, 78, 172.2, 6.6),
(151, 'dev-001', '2025-04-11 18:12:21', 31.5, 62, 170.2, 1.1),
(152, 'dev-001', '2025-01-22 20:04:01', 30.3, 66, 122.4, 4.2),
(153, 'dev-001', '2025-04-03 00:26:11', 33.2, 50, 146.3, 3.6),
(154, 'dev-001', '2025-02-21 19:17:55', 29, 66, 173, 9.7),
(155, 'dev-001', '2025-02-06 13:00:13', 33.3, 55, 64.2, 6.6),
(156, 'dev-001', '2025-03-21 17:45:38', 33.7, 72, 177.2, 6.7),
(157, 'dev-001', '2025-02-08 04:40:14', 28.9, 64, 105.9, 4.2),
(158, 'dev-001', '2025-02-07 05:59:57', 35.7, 70, 194.9, 5.1),
(159, 'dev-001', '2025-01-21 10:57:47', 30.7, 72, 111.4, 2.7),
(160, 'dev-001', '2025-02-25 19:04:27', 34.4, 47, 59.3, 8.2),
(161, 'dev-001', '2025-01-22 14:12:17', 33.1, 64, 134.5, 6.3),
(162, 'dev-001', '2025-03-30 00:53:14', 31, 43, 146, 0.4),
(163, 'dev-001', '2025-03-25 04:36:44', 30, 41, 61.6, 3.5),
(164, 'dev-001', '2025-02-14 14:28:04', 30.5, 61, 132.3, 6.1),
(165, 'dev-001', '2025-02-13 00:52:55', 33.7, 72, 168.7, 0.5),
(166, 'dev-001', '2025-04-06 18:37:43', 35.9, 55, 102.2, 3.6),
(167, 'dev-001', '2025-03-06 07:52:30', 33.5, 61, 130.3, 6.3),
(168, 'dev-001', '2025-02-28 12:59:48', 31.7, 75, 122.6, 2.8),
(169, 'dev-001', '2025-01-20 00:27:17', 30.3, 62, 191, 7.2),
(170, 'dev-001', '2025-04-02 22:13:39', 29.8, 63, 63.1, 7.2),
(171, 'dev-001', '2025-03-03 20:15:43', 35.6, 46, 155.1, 1.2),
(172, 'dev-001', '2025-03-09 13:46:01', 30.4, 48, 156.3, 6.1),
(173, 'dev-001', '2025-03-04 21:11:37', 30.1, 44, 191.5, 5.6),
(174, 'dev-001', '2025-03-24 00:01:23', 29.6, 76, 63.8, 8.2),
(175, 'dev-001', '2025-03-07 15:03:19', 35.2, 80, 195.7, 7.2),
(176, 'dev-001', '2025-01-24 07:57:41', 34.1, 74, 158.6, 5.2),
(177, 'dev-001', '2025-01-23 14:09:42', 30.4, 62, 162.3, 7.4),
(178, 'dev-001', '2025-03-27 08:31:07', 28.9, 70, 130.8, 7.2),
(179, 'dev-001', '2025-02-11 17:04:57', 29.2, 62, 84.1, 5.7),
(180, 'dev-001', '2025-02-15 16:28:35', 30.5, 65, 125.9, 0.8),
(181, 'dev-001', '2025-01-26 22:50:11', 30.3, 71, 170.6, 4.5),
(182, 'dev-001', '2025-01-27 17:32:17', 28.8, 67, 163.3, 7.3),
(183, 'dev-001', '2025-03-26 04:11:32', 28.8, 61, 132.1, 6.9),
(184, 'dev-001', '2025-04-17 06:16:24', 28.1, 43, 150.7, 0.1),
(185, 'dev-001', '2025-04-08 01:32:13', 28.2, 53, 145.9, 4.4),
(186, 'dev-001', '2025-02-12 01:36:46', 35.1, 53, 84, 5.4),
(187, 'dev-001', '2025-01-29 23:23:19', 28.7, 58, 191.6, 6.4),
(188, 'dev-001', '2025-04-04 18:20:08', 34.7, 65, 125.9, 8.9),
(189, 'dev-001', '2025-04-20 01:10:42', 31.8, 54, 77.6, 3.3),
(190, 'dev-001', '2025-02-02 21:42:42', 28.4, 63, 158.5, 2.2),
(191, 'dev-001', '2025-04-20 01:10:42', 32.1, 74, 157.5, 7.3),
(192, 'dev-001', '2025-04-20 01:10:42', 32.4, 54, 57.2, 5),
(193, 'dev-001', '2025-04-20 01:10:42', 29.2, 62, 84.8, 5.8),
(194, 'dev-001', '2025-02-04 19:36:01', 29.5, 51, 135.8, 1.6),
(195, 'dev-001', '2025-02-05 19:36:47', 31.8, 79, 129, 8.7),
(196, 'dev-001', '2025-04-20 01:10:42', 31.5, 40, 64.4, 2),
(197, 'dev-001', '2025-02-19 10:17:59', 32.2, 61, 79.6, 4.3),
(198, 'dev-001', '2025-04-20 01:10:42', 35.4, 70, 89, 8.1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `acc_doctor`
--
ALTER TABLE `acc_doctor`
  ADD PRIMARY KEY (`id_table_doctor`);

--
-- Indexes for table `acc_farmer`
--
ALTER TABLE `acc_farmer`
  ADD PRIMARY KEY (`id_table`);

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `because_delete`
--
ALTER TABLE `because_delete`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `because_status`
--
ALTER TABLE `because_status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `check_form_detail`
--
ALTER TABLE `check_form_detail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `check_plant_detail`
--
ALTER TABLE `check_plant_detail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `chemical_list`
--
ALTER TABLE `chemical_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `detailedit`
--
ALTER TABLE `detailedit`
  ADD PRIMARY KEY (`id_detail`);

--
-- Indexes for table `ecph`
--
ALTER TABLE `ecph`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `editform`
--
ALTER TABLE `editform`
  ADD PRIMARY KEY (`id_edit`);

--
-- Indexes for table `fertilizer_list`
--
ALTER TABLE `fertilizer_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `formchemical`
--
ALTER TABLE `formchemical`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `formfertilizer`
--
ALTER TABLE `formfertilizer`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `formplant`
--
ALTER TABLE `formplant`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `housefarm`
--
ALTER TABLE `housefarm`
  ADD PRIMARY KEY (`id_farm_house`);

--
-- Indexes for table `log_admin`
--
ALTER TABLE `log_admin`
  ADD PRIMARY KEY (`id`),
  ADD KEY `admin_id` (`admin_id`);

--
-- Indexes for table `message_user`
--
ALTER TABLE `message_user`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notify_doctor`
--
ALTER TABLE `notify_doctor`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `pests`
--
ALTER TABLE `pests`
  ADD PRIMARY KEY (`pest_id`);

--
-- Indexes for table `pest_chemical`
--
ALTER TABLE `pest_chemical`
  ADD PRIMARY KEY (`id`),
  ADD KEY `pest_id` (`pest_id`),
  ADD KEY `chemical_id` (`chemical_id`);

--
-- Indexes for table `plant_list`
--
ALTER TABLE `plant_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `record_edit`
--
ALTER TABLE `record_edit`
  ADD PRIMARY KEY (`id_record_edit`);

--
-- Indexes for table `report_detail`
--
ALTER TABLE `report_detail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sensor_weather_greenhouse`
--
ALTER TABLE `sensor_weather_greenhouse`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sensor_weather_station`
--
ALTER TABLE `sensor_weather_station`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `source_list`
--
ALTER TABLE `source_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `station_list`
--
ALTER TABLE `station_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `success_detail`
--
ALTER TABLE `success_detail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `varieties`
--
ALTER TABLE `varieties`
  ADD PRIMARY KEY (`variety_id`),
  ADD KEY `fk_varieties_plant_list` (`plant_id`);

--
-- Indexes for table `weather_greenhouse`
--
ALTER TABLE `weather_greenhouse`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `weather_station`
--
ALTER TABLE `weather_station`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `acc_doctor`
--
ALTER TABLE `acc_doctor`
  MODIFY `id_table_doctor` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `acc_farmer`
--
ALTER TABLE `acc_farmer`
  MODIFY `id_table` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `because_delete`
--
ALTER TABLE `because_delete`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `because_status`
--
ALTER TABLE `because_status`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `check_form_detail`
--
ALTER TABLE `check_form_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `check_plant_detail`
--
ALTER TABLE `check_plant_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `chemical_list`
--
ALTER TABLE `chemical_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `detailedit`
--
ALTER TABLE `detailedit`
  MODIFY `id_detail` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=213;

--
-- AUTO_INCREMENT for table `ecph`
--
ALTER TABLE `ecph`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `editform`
--
ALTER TABLE `editform`
  MODIFY `id_edit` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=156;

--
-- AUTO_INCREMENT for table `fertilizer_list`
--
ALTER TABLE `fertilizer_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `formchemical`
--
ALTER TABLE `formchemical`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=170;

--
-- AUTO_INCREMENT for table `formfertilizer`
--
ALTER TABLE `formfertilizer`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `housefarm`
--
ALTER TABLE `housefarm`
  MODIFY `id_farm_house` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `log_admin`
--
ALTER TABLE `log_admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `message_user`
--
ALTER TABLE `message_user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=142;

--
-- AUTO_INCREMENT for table `notify_doctor`
--
ALTER TABLE `notify_doctor`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=493;

--
-- AUTO_INCREMENT for table `pests`
--
ALTER TABLE `pests`
  MODIFY `pest_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `pest_chemical`
--
ALTER TABLE `pest_chemical`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `plant_list`
--
ALTER TABLE `plant_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `record_edit`
--
ALTER TABLE `record_edit`
  MODIFY `id_record_edit` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `report_detail`
--
ALTER TABLE `report_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `sensor_weather_greenhouse`
--
ALTER TABLE `sensor_weather_greenhouse`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `sensor_weather_station`
--
ALTER TABLE `sensor_weather_station`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `source_list`
--
ALTER TABLE `source_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `station_list`
--
ALTER TABLE `station_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `success_detail`
--
ALTER TABLE `success_detail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT for table `varieties`
--
ALTER TABLE `varieties`
  MODIFY `variety_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `weather_greenhouse`
--
ALTER TABLE `weather_greenhouse`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `weather_station`
--
ALTER TABLE `weather_station`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=199;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `log_admin`
--
ALTER TABLE `log_admin`
  ADD CONSTRAINT `log_admin_ibfk_1` FOREIGN KEY (`admin_id`) REFERENCES `admin` (`id`);

--
-- Constraints for table `pest_chemical`
--
ALTER TABLE `pest_chemical`
  ADD CONSTRAINT `pest_chemical_ibfk_2` FOREIGN KEY (`chemical_id`) REFERENCES `chemical_list` (`id`);

--
-- Constraints for table `varieties`
--
ALTER TABLE `varieties`
  ADD CONSTRAINT `fk_varieties_plant_list` FOREIGN KEY (`plant_id`) REFERENCES `plant_list` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
